[
    {
        "Scientific Name": "Astragalus psilocentros",
        "Local Name": "Sokhrus, Biacharbeon, Biacharchoo",
        "Family": "Fabaceae (Leguminosae)",
        "Type": "Subshrub",
        "Location": "Skardu, Baltistan, Ganche",
        "Parts Used": "Roots, leaves, branches, thorny branches",
        "Uses": "Supports immune system; treats colds, flu, toothache, diabetes, and liver issues; adaptogenic; immune stimulant; diuretic; vasodilator; antibacterial; anti-inflammatory",
        "Preparation & Dosage": "Infusion: Infuse 1 tsp root or leaves; drink once or twice daily. Decoction: Boil 5 g dried root in 1 cup water; take once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; avoid in autoimmune diseases; may interact with immune drugs; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Anaphalis triplinervis",
        "Local Name": "Yeephosh, Ghang",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Kharmong, All regions",
        "Parts Used": "Flowers, leaves",
        "Uses": "Antiasthmatic; anticough; expectorant; sedative; antiphlogistic; also used for epilepsy and wound healing.",
        "Preparation & Dosage": "Infusion (flowers): Steep in hot water for general respiratory and sedative effects. Infusion (leaves): Steep 5 g dried leaves in hot water; drink 1 cup twice daily for respiratory issues. Topical: Apply infusion to wounds.",
        "Side Effects / Precautions": "Use under supervision; generally safe but avoid large doses during pregnancy; consult healthcare provider if epileptic."
    },
    {
        "Scientific Name": "Sophora alopecuroides",
        "Local Name": "Kudouzi",
        "Family": "Leguminosae",
        "Type": "Under-shrub",
        "Location": "All regions",
        "Parts Used": "Seeds, whole plant",
        "Uses": "Antibacterial, analgesic, anti-inflammatory, anti-rheumatic, gastrointestinal disorders, fever, antiviral, antioxidant, neuroprotective",
        "Preparation & Dosage": "Seeds: Decoction of 3-5g seeds boiled in water, taken once daily; Whole plant used as topical poultice for inflammation",
        "Side Effects / Precautions": "Seeds contain toxic alkaloids; overdose may cause nausea, dizziness; avoid during pregnancy and liver disorders"
    },
    {
        "Scientific Name": "Capparis spinosa",
        "Local Name": "Shorot, Kawir, Kraba",
        "Family": "Capparaceae (Capparidaceae)",
        "Type": "Shrub / Herb",
        "Location": "Skardu, Deosi, Baltistan, All regions",
        "Parts Used": "Fruit juice, flowers, seeds, branches, root bark, whole plant",
        "Uses": "Treats splenomegaly, mental disorders, tubercular glands, rheumatoid arthritis, gout; useful in arthritis; flowers eaten as vegetables; branches used in poultices.",
        "Preparation & Dosage": "Fruit juice: Consume 1 tbsp fresh fruit juice once daily. Flowers: Eat fresh or dried; prepare decoction for medicinal use. Seeds: Boil in water and drink twice daily. Root bark: Boil 5 g in water, drink once daily. Branches: Apply topically as poultices.",
        "Side Effects / Precautions": "Use cautiously; may cause allergic reactions (especially if allergic to capers); avoid high doses during pregnancy; consult healthcare provider for chronic conditions."
    },
    {
        "Scientific Name": "Matricaria chamomilla",
        "Local Name": "Sokhma",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Leaves paste",
        "Uses": "Treats infections, neuropsychiatric, respiratory, gastrointestinal, and liver diseases",
        "Preparation & Dosage": "Leaves paste applied topically on affected area or infusion of leaves 1 cup twice daily orally",
        "Side Effects / Precautions": "Generally safe; possible allergic reactions in sensitive individuals; avoid large doses during pregnancy"
    },
    {
        "Scientific Name": "Saussurea abvallata",
        "Local Name": "Karfo mendoq",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Flower bud, root paste",
        "Uses": "Treats paralysis, cerebral ischemia, wounds, cuts, bruises, liver disorders, bone-ache, cough, intestinal and urinal issues; veterinary uses",
        "Preparation & Dosage": "Root paste applied topically on wounds and bruises; flower bud decoction 5g in 1 cup water, once daily orally",
        "Side Effects / Precautions": "Generally safe; avoid use during pregnancy; consult doctor if allergic or with chronic illnesses"
    },
    {
        "Scientific Name": "Tanacetum dolichophyllum",
        "Local Name": "Api chot",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Leaves juice",
        "Uses": "Treats pulmonary disorders, kidney stones, fever, and intestinal worms",
        "Preparation & Dosage": "Fresh leaves juice: Drink 1-2 teaspoons once daily for kidney and lung support",
        "Side Effects / Precautions": "May cause allergic reactions or stomach irritation; avoid large doses during pregnancy"
    },
    {
        "Scientific Name": "Tussilago farfara",
        "Local Name": "Churut",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Leaves infusion",
        "Uses": "Treats asthma, cough, sore throat, airway swelling",
        "Preparation & Dosage": "Infusion: Steep 2-3g dried leaves in hot water, drink 1 cup twice daily",
        "Side Effects / Precautions": "Contains pyrrolizidine alkaloids (toxic if used long-term); may cause allergic skin reactions in sensitive people; avoid use in pregnancy and liver disease"
    },
    {
        "Scientific Name": "Biebersteinia odora",
        "Local Name": "Khoros, Chundol",
        "Family": "Biebersteiniaceae",
        "Type": "Herb",
        "Location": "All regions, Shiger",
        "Parts Used": "Flowers, fresh flowers, roots",
        "Uses": "Treats skin diseases; insect repellent; antiseptic; blood purifier; ornamental; food use; treats bone fractures and musculoskeletal disorders; has anti-nociceptive and anti-inflammatory effects.",
        "Preparation & Dosage": "Decoction: Boil 5 g fresh root or flowers in water; take orally or apply topically once daily. Poultice: Boil flowers and apply directly to affected area for bone or muscle issues.",
        "Side Effects / Precautions": "Generally safe; possible skin irritation in sensitive individuals; avoid if allergic; avoid during pregnancy; limited data on long-term safety."
    },
    {
        "Scientific Name": "Chenopodium foliosum",
        "Local Name": "Suyaro, Osay",
        "Family": "Chenopodiaceae",
        "Type": "Herb",
        "Location": "Kharmong, All regions",
        "Parts Used": "Leaves, fruit juice, tender shoots",
        "Uses": "Antimicrobial; cytotoxic; anticancer; anti-inflammatory; analgesic; antinociceptive; antioxidant; antidiabetic; anti-snake and anti-scorpion venom treatment.",
        "Preparation & Dosage": "Infusion (leaves): Prepare as herbal tea for medicinal effects. Fresh fruit juice/tender shoots: Consume orally, 1–2 teaspoons daily depending on condition.",
        "Side Effects / Precautions": "Limited toxicity data; generally safe but may cause mild gastrointestinal discomfort or allergic reaction in sensitive individuals."
    },
    {
        "Scientific Name": "Rhodiola imbricata",
        "Local Name": "Chundol",
        "Family": "Crassulaceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Root powder",
        "Uses": "Treats cold, cough, lung problems, fever, pulmonary complaints, and fatigue in traditional medicine",
        "Preparation & Dosage": "Root powder taken orally; typical dose: 500 mg to 1g per day",
        "Side Effects / Precautions": "Generally safe; possible mild dizziness or dry mouth; avoid in pregnancy"
    },
    {
        "Scientific Name": "Silene indica",
        "Local Name": "Bguk mendoq",
        "Family": "Caryophyllaceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Root decoction",
        "Uses": "Used for washing (soap), snake bite treatment, corns, and warts",
        "Preparation & Dosage": "Decoction prepared by boiling roots; used topically for skin ailments",
        "Side Effects / Precautions": "Contains saponins (mildly toxic); may cause skin irritation; avoid ingestion"
    },
    {
        "Scientific Name": "Silene vulgaris",
        "Local Name": "Bajo mendoq",
        "Family": "Caryophyllaceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Leaves juice",
        "Uses": "Used for washing (soap), snake bite treatment, corns, and warts",
        "Preparation & Dosage": "Juice extracted from leaves; used topically for skin ailments",
        "Side Effects / Precautions": "Contains saponins (mildly toxic); may cause skin irritation; avoid ingestion"
    },
    {
        "Scientific Name": "Corydalis falconeri",
        "Local Name": "Shorot",
        "Family": "Fumariaceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Leaves",
        "Uses": "Treats female sterility, abdominal worms, tonsillitis, inflammation, indigestion",
        "Preparation & Dosage": "Leaves boiled or made into infusion; drink 1 cup daily",
        "Side Effects / Precautions": "Possible mild digestive upset or allergic reaction; consult before use in pregnancy"
    },
    {
        "Scientific Name": "Corydalis stewartii",
        "Local Name": "Shorot",
        "Family": "Fumariaceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Flower decoction",
        "Uses": "Analgesic, sedative, hypnotic; treats headache, insomnia, menstrual migraine, and dysmenorrhea",
        "Preparation & Dosage": "Flower decoction taken orally; typical dose is 1 cup at night before sleep",
        "Side Effects / Precautions": "May cause drowsiness, dizziness, or low blood pressure; avoid driving or combining with sedatives"
    },
    {
        "Scientific Name": "Equisetum arvense",
        "Local Name": "Thangshin g harswa, Thangshiat wa, Thangshingy harswa",
        "Family": "Equisetaceae",
        "Type": "Herb",
        "Location": "All regions, Shiger, Baltistan",
        "Parts Used": "Aerial parts, whole plant",
        "Uses": "Stops bleeding; heals ulcers and wounds; treats tuberculosis and kidney problems; helps with urine disorders.",
        "Preparation & Dosage": "Decoction: Boil aerial parts or whole plant; drink 1 cup daily (or twice daily for urinary issues). Topical: Apply decoction to wounds for healing.",
        "Side Effects / Precautions": "Avoid prolonged use; may cause vitamin B1 deficiency; not recommended for people with heart or kidney conditions; may affect kidney function if overused."
    },
    {
        "Scientific Name": "Swertia cordata",
        "Local Name": "Tikta, Karfo sman",
        "Family": "Gentianaceae (formerly Glossulariaceae)",
        "Type": "Herb",
        "Location": "Shiger, All regions",
        "Parts Used": "Whole plant, leaves, flowers",
        "Uses": "Treats hepatitis; gallbladder infection (cholecystitis); pneumonia; bone inflammation (osteomyelitis); dysentery; skin infections; scabies.",
        "Preparation & Dosage": "Decoction (whole plant): Boil and drink for internal conditions. Infusion (leaves): 1–2 cups daily. Flower powder: Take a pinch with honey. Topical paste: Apply to skin for scabies.",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause nausea or low blood pressure in sensitive individuals; consult a healthcare provider for liver conditions."
    },
    {
        "Scientific Name": "Anisomeles indica",
        "Local Name": "Sunpo harswa",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Aerial parts infusion",
        "Uses": "Treats digestive disorders, abdominal pain, colic, allergies, inflammation, and rheumatic arthritis",
        "Preparation & Dosage": "Infusion of dried aerial parts; 1 cup, 1–2 times daily",
        "Side Effects / Precautions": "May cause drowsiness or allergic reactions in sensitive individuals; consult for long-term use"
    },
    {
        "Scientific Name": "Isodon nigosuus",
        "Local Name": "So-sman",
        "Family": "Lamiaceae",
        "Type": "Shrub",
        "Location": "All regions",
        "Parts Used": "Dried leaves",
        "Uses": "Treats digestive issues, cough, bronchitis, hypertension, and heart-related conditions",
        "Preparation & Dosage": "Dried leaves used as herbal tea (infusion); 1 cup daily or as prescribed",
        "Side Effects / Precautions": "May cause dizziness or allergic reactions; avoid in pregnancy and with heart medications"
    },
    {
        "Scientific Name": "Nepeta erecta",
        "Local Name": "Mominan",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Leaves",
        "Uses": "Used for inflammation, pain relief, Alzheimer's, cancer treatment, immunity boost, microbial and fungal infections",
        "Preparation & Dosage": "Infusion or powdered leaves; 1 cup once daily, or 1/2 tsp powder in warm water",
        "Side Effects / Precautions": "May cause dizziness or nausea in high doses; avoid during pregnancy or in children without medical advice"
    },
    {
        "Scientific Name": "Nepeta glutinosa",
        "Local Name": "Mpminan",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Leaves infusion",
        "Uses": "Used to treat asthma, cough, fever, convulsions, and skin eruptions in children. Also applied for scorpion/snake bites and wound healing.",
        "Preparation & Dosage": "1 tsp dried leaves in hot water as infusion, 1 cup daily. Paste applied externally on skin",
        "Side Effects / Precautions": "May cause mild sedation; avoid in pregnant women and infants without supervision; allergic reactions possible on skin"
    },
    {
        "Scientific Name": "Otostegia aucheri",
        "Local Name": "Chashing",
        "Family": "Lamiaceae",
        "Type": "Shrub",
        "Location": "All regions",
        "Parts Used": "Root decoction",
        "Uses": "Used to manage type 2 diabetes, antioxidant therapy; source of labdane diterpenoids and phenolic compounds.",
        "Preparation & Dosage": "Root decoction: boil 1 tsp dried root in 1 cup water, consume daily before meals",
        "Side Effects / Precautions": "May cause hypoglycemia if taken with diabetes medication; avoid in pregnancy; allergic reactions possible"
    },
    {
        "Scientific Name": "Salvia nubkola",
        "Local Name": "Phora",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Leaves paste",
        "Uses": "Used for epilepsy, cough relief, fever reduction, dental care, diarrhea in children, wound healing, and bleeding control",
        "Preparation & Dosage": "Paste applied topically on wounds; infusion for diarrhea; dose varies by use",
        "Side Effects / Precautions": "May cause nausea, vomiting, dizziness; not recommended for epilepsy patients without supervision; may irritate digestive tract"
    },
    {
        "Scientific Name": "Morina coulteriana",
        "Local Name": "Brangus",
        "Family": "Morinaceae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Root infusion",
        "Uses": "Used for digestion, treating indigestion, vomiting, nausea; stem, leaves, flowers used as stomachic and emetic agents",
        "Preparation & Dosage": "Root infusion: boil 1 tsp dried root in 1 cup water, drink before meals once daily",
        "Side Effects / Precautions": "May cause vomiting and nausea if overdosed; use carefully in pregnant women and sensitive individuals"
    },
    {
        "Scientific Name": "Satyrium nepalense",
        "Local Name": "Broq lala",
        "Family": "Orchidaceae",
        "Type": "Herb",
        "Location": "High altitudes (2400-5000m)",
        "Parts Used": "Tuber powder",
        "Uses": "Energetic tonic; used traditionally for treating fever of different types",
        "Preparation & Dosage": "Powder of dried tubers, 1-2 grams orally once daily",
        "Side Effects / Precautions": "Rare allergic reactions; avoid overdose; endangered species—harvest sustainably"
    },
    {
        "Scientific Name": "Medicago fakata",
        "Local Name": "Buksuk",
        "Family": "Papilionaceae",
        "Type": "Herb",
        "Location": "Ganche",
        "Parts Used": "Aerial parts paste",
        "Uses": "Neuroprotective, antioxidant, antiulcer, antimicrobial, hypolipidemic, hypocholesterolemic",
        "Preparation & Dosage": "Fresh aerial parts crushed and applied as paste externally, or used as herbal tea (1 tsp dried parts in hot water) once daily",
        "Side Effects / Precautions": "May cause mild allergic reactions in sensitive individuals; not recommended during pregnancy without medical advice"
    },
    {
        "Scientific Name": "Melilotus officinalis",
        "Local Name": "Serfo buksuk",
        "Family": "Papilionaceae",
        "Type": "Herb",
        "Location": "Ganche",
        "Parts Used": "Leaves infusion",
        "Uses": "Used for wound healing and as a blood thinner; supports circulation and anti-inflammatory",
        "Preparation & Dosage": "Infuse 1 tsp dried leaves in hot water; consume once daily or apply topically",
        "Side Effects / Precautions": "May increase bleeding risk if overused or combined with blood thinners; avoid in pregnancy and bleeding disorders"
    },
    {
        "Scientific Name": "Oxytropis lapponica",
        "Local Name": "Chalma mendoq",
        "Family": "Papilionaceae",
        "Type": "Herb",
        "Location": "Ganche",
        "Parts Used": "Aerial parts decoction",
        "Uses": "Used in traditional medicine; potential anti-cancer properties",
        "Preparation & Dosage": "Decoction of aerial parts: boil 1 tsp in 1 cup water for 10 mins; take once daily",
        "Side Effects / Precautions": "May contain toxic alkaloids; long-term or high-dose use can be harmful; use with caution; avoid in pregnancy and liver disorders"
    },
    {
        "Scientific Name": "Parnassia nubkola",
        "Local Name": "Mulus",
        "Family": "Parnassiaceae",
        "Type": "Herb",
        "Location": "Ganche, Skardu, Hunza",
        "Parts Used": "Root paste, leaf juice",
        "Uses": "Root paste for cuts and wounds; leaf juice for eye problems and inflammation",
        "Preparation & Dosage": "Apply fresh root paste on wounds; use 1–2 drops of leaf juice diluted in water for eye issues",
        "Side Effects / Precautions": "No major side effects noted; possible irritation if used undiluted in sensitive eyes; use hygienically"
    },
    {
        "Scientific Name": "Acantholimon lycopodioles",
        "Local Name": "Marsi",
        "Family": "Plumbaginaceae",
        "Type": "Shrub",
        "Location": "Ganche, Skardu",
        "Parts Used": "Leaves powder",
        "Uses": "Used traditionally to treat cardiac disorders, muscular pain, and as an abortifacient",
        "Preparation & Dosage": "Powdered leaves taken orally: 1/4 tsp with warm water once daily for muscle pain and heart issues",
        "Side Effects / Precautions": "Not safe during pregnancy due to abortifacient properties; possible uterine stimulation; consult physician before use"
    },
    {
        "Scientific Name": "Setaria virkis",
        "Local Name": "Harswa",
        "Family": "Poaceae",
        "Type": "Herb",
        "Location": "Ganche, Skardu",
        "Parts Used": "Seed powder, whole plant",
        "Uses": "Seed is diuretic, emollient, febrifuge, refrigerant, tonic; plant paste used for bruises",
        "Preparation & Dosage": "Internal: 1 tsp seed powder with water once daily; External: plant crushed, paste applied on bruises",
        "Side Effects / Precautions": "May cause mild irritation on sensitive skin; not recommended for prolonged use internally without supervision"
    },
    {
        "Scientific Name": "Aconogonon tortuosum",
        "Local Name": "Chunma",
        "Family": "Polygonaceae",
        "Type": "Subshrub",
        "Location": "Ganche, Skardu",
        "Parts Used": "Aerial parts powder, root decoction",
        "Uses": "Used to control painful urination, treat joint pain, arthritis, jaundice, stomach pain, and for blood purification",
        "Preparation & Dosage": "Root decoction: Boil 5g root in 1 cup water, take twice a day. Powder: 1/2 tsp of dried aerial parts with warm water once daily.",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause diarrhea or nausea if overdosed. Seek traditional guidance for safe use."
    },
    {
        "Scientific Name": "Polygonum aviculare",
        "Local Name": "Sathing",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Ganche",
        "Parts Used": "Leaves paste",
        "Uses": "Used for urinary tract stones, urinary inflammation, gingivitis, inflammatory diseases, wounds. Also works as anthelmintic, cardiac tonic, and vasoconstrictor.",
        "Preparation & Dosage": "Leaves paste: Apply topically to wounds/inflammation. For urinary issues, decoction of 5g dried leaves in 1 cup water, once daily.",
        "Side Effects / Precautions": "Avoid in pregnancy and with kidney disease without medical advice. May cause mild allergic reaction or gastric discomfort in sensitive individuals."
    },
    {
        "Scientific Name": "Perskaria amphibia",
        "Local Name": "Chusmin",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Ganche",
        "Parts Used": "Leaves infusion, root infusion, raw root",
        "Uses": "Treats stomach pains, diarrhea in children, and chest colds",
        "Preparation & Dosage": "Leaves infusion: Boil 5g leaves in water, drink once daily. Root: Raw or dried root infusion for colds.",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause mild digestive upset"
    },
    {
        "Scientific Name": "Primula macrophylla",
        "Local Name": "Lelo, Lelio, Sman harswa",
        "Family": "Primulaceae",
        "Type": "Herb",
        "Location": "Kharmong, Ganche",
        "Parts Used": "Mature roots, aerial parts",
        "Uses": "Treatment of ophthalmic diseases, especially eye infections; expectorant for coughs with colds (adults and adolescents over 12 years).",
        "Preparation & Dosage": "Infusion/Decoction (roots): Prepare from mature roots for eye-related conditions. Infusion (aerial parts): Boil 5 g in water; drink once or twice daily.",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause mild allergic reactions in sensitive individuals; not for children under 12 years; use under medical guidance."
    },
    {
        "Scientific Name": "Aquilegia pubiflora",
        "Local Name": "Koo-kuk, Domba",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Skardu, Baltistan, Ganche",
        "Parts Used": "Floral parts, leaves, dried root",
        "Uses": "Used traditionally for burns, wound healing, jaundice, hepatitis, cardiovascular and circulatory diseases.",
        "Preparation & Dosage": "Infusion (floral parts): Infuse 1–2 tsp in hot water; drink once daily or apply externally. Paste (leaves): Apply topically for burns/wounds. Decoction (leaves or root): Used for wounds and internal conditions. Root powder: Taken traditionally in small amounts for specific ailments.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; toxic if ingested in large amounts; consult healthcare provider for proper dosage; use with care in sensitive individuals."
    },
    {
        "Scientific Name": "Bergenia stracheyi",
        "Local Name": "Khichy",
        "Family": "Saxifragaceae",
        "Type": "Herb",
        "Location": "Ganche",
        "Parts Used": "Leaves infusion",
        "Uses": "Used for kidney/bladder diseases, dysuria, heart, lung, liver diseases, spleen enlargement, tumors, ulcers, piles, dysentery, menorrhagia, hydrophobia, cough, fever, biliousness, eyesores",
        "Preparation & Dosage": "Leaves infusion as used traditionally; dosage varies",
        "Side Effects / Precautions": "Use cautiously if you have allergies or sensitive conditions; consult a healthcare provider."
    },
    {
        "Scientific Name": "Pedicularis punctata",
        "Local Name": "Spanthing",
        "Family": "Scrophulariaceae",
        "Type": "Herb",
        "Location": "Ganche",
        "Parts Used": "Flower powder",
        "Uses": "Used in Traditional Chinese Medicine as a cardio-tonic, to improve blood circulation, and treat exhaustion, collapse, senility, and digestive problems",
        "Preparation & Dosage": "Flower powder as used traditionally; dosage varies",
        "Side Effects / Precautions": "May cause allergic reactions in sensitive individuals; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Potentilla salesoviana",
        "Local Name": "Laik sman, Karfo mendoq",
        "Family": "Rosaceae",
        "Type": "Herb / Shrub",
        "Location": "Ganche, Skardu, Baltistan",
        "Parts Used": "Flowers, roots, stems, leaves",
        "Uses": "Used traditionally for sore throat, cough, stomach problems, menstrual cramps (dysmenorrhea), premenstrual syndrome (PMS); roots and stems edible; leaves eaten as salad.",
        "Preparation & Dosage": "Infusion (flowers): Infuse 1 tsp in hot water; drink once daily or warm for cough/stomach issues. Food use: Roots eaten raw or cooked; stems and leaves consumed as salad.",
        "Side Effects / Precautions": "Avoid during pregnancy; lack of strong scientific evidence; possible allergic reactions; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Capsella bursapastoris",
        "Local Name": "Passkey",
        "Family": "Brassicaceae",
        "Type": "Herb",
        "Location": "Ganche",
        "Parts Used": "Seed and leaves",
        "Uses": "Traditionally used to treat heavy uterine bleeding, hematuria, and menorrhagia.",
        "Preparation & Dosage": "Seeds and leaves prepared as decoctions or infusions; dosage depends on condition.",
        "Side Effects / Precautions": "Use cautiously, especially by women with reproductive health concerns; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Thymus serpyllum",
        "Local Name": "Ree tumburuk",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Ganche, Baltistan",
        "Parts Used": "Leaves, floral parts",
        "Uses": "Used externally as an antiseptic for wounds, eczema, and swelling; treats sore throat and fever; also used in cooking for flavoring meat or fish.",
        "Preparation & Dosage": "External: Apply as poultice or infusion for wounds, eczema, swelling. Internal: Infuse leaves and flowers, drink warm for sore throat or fever. Culinary: Use in small amounts for flavoring.",
        "Side Effects / Precautions": "Avoid overuse on sensitive skin; avoid excess internal use; may cause allergic reactions; consult before use in pregnancy."
    },
    {
        "Scientific Name": "Trifolium fragiferum",
        "Local Name": "Gul-e nasreen",
        "Family": "Leguminosae",
        "Type": "Herb",
        "Location": "Ganche, Baltistan",
        "Parts Used": "Flowers, leaves",
        "Uses": "Used as antiseptic, analgesic, anti-inflammatory, anti-cancer agents, in angiogenesis; treats headache and dermal infections.",
        "Preparation & Dosage": "Infusion of flowers and leaves (drink daily) or apply as paste for skin conditions; dosage varies by condition.",
        "Side Effects / Precautions": "Avoid during pregnancy; avoid if allergic to legumes; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Primula farinosa",
        "Local Name": "Spangpun ar, Spangpunar",
        "Family": "Primulaceae",
        "Type": "Herb",
        "Location": "Ganche, Baltistan",
        "Parts Used": "Flowers",
        "Uses": "Supports respiratory health, pain management, stress relief; acts as a blood purifier; treats dysentery.",
        "Preparation & Dosage": "Flower infusions or extracts for general health; decoction (drink daily) for blood purification and dysentery.",
        "Side Effects / Precautions": "Avoid during pregnancy; use with caution and consult healthcare provider before use."
    },
    {
        "Scientific Name": "Ficus carica",
        "Local Name": "Injeer",
        "Family": "Moraceae",
        "Type": "Tree/Herb",
        "Location": "Deosi, all regions, Ganche",
        "Parts Used": "Fruits",
        "Uses": "Removes kidney stones; treats liver and spleen obstructions; supports digestive, endocrine, reproductive, and respiratory health; helps with gastrointestinal and urinary tract infections.",
        "Preparation & Dosage": "Fruits eaten fresh or dried; can be cooked or prepared as decoction for internal use; dosage varies.",
        "Side Effects / Precautions": "Excess consumption may cause diarrhea; avoid if allergic to figs; use cautiously if diabetic; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Carum carvi",
        "Local Name": "Zera",
        "Family": "Apiaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Seed decoction",
        "Uses": "Used traditionally as a spice and herbal medicine for digestive issues like dyspepsia, spasms, bloating, diarrhea, flatulent colic; also diuretic, expectorant, promotes maternal milk, and relieves dysmenorrhea.",
        "Preparation & Dosage": "Seed decoction; dosage varies",
        "Side Effects / Precautions": "Avoid during pregnancy; consult healthcare provider"
    },
    {
        "Scientific Name": "Rosa brunonii",
        "Local Name": "Siya",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Skardu, Ganche",
        "Parts Used": "Bark infusion",
        "Uses": "Used as a blood purifier, to stimulate wound healing, and treat infectious diseases.",
        "Preparation & Dosage": "Bark infusion; dosage varies",
        "Side Effects / Precautions": "Avoid during pregnancy; consult healthcare provider"
    },
    {
        "Scientific Name": "Pedicularis cheilanthifolia",
        "Local Name": " Serfo spanthing",
        "Family": "Scrophulariaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves (decoction)",
        "Uses": "Treats leucorrhoea, fevers, sterility, rheumatism, general debility, collapse, and urinary problems.",
        "Preparation & Dosage": "Boil 1 tsp leaves in water and drink once daily; dosage may vary traditionally.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Pedicularis pectinatiformis",
        "Local Name": "Sunpo spanthing",
        "Family": "Scrophulariaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves infusion",
        "Uses": "Used in the treatment of leucorrhoea, fevers, sterility, rheumatism, general debility, collapse, and urinary problems.",
        "Preparation & Dosage": "Infuse 1–2 teaspoons of dried leaves in hot water, drink 1–2 times daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Polygonum tatricum",
        "Local Name": "Kho-bro",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Seed and leaves",
        "Uses": "Used as an expectorant for cough and bronchitis. Also for piles, hemorrhages, diarrhea, urinary tract inflammation, and gingivitis.",
        "Preparation & Dosage": "Boil 1 teaspoon of seeds/leaves in water; drink once or twice daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Fagopyrum esculentum",
        "Local Name": "Sta-bro",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves, seed",
        "Uses": "Reduces plasma cholesterol; anti-inflammatory, neuroprotective, anticancer, antidiabetic, anti-hypertensive. Used in gluten-free diets and celiac disease.",
        "Preparation & Dosage": "Cook seeds like rice or use leaves in infusions. Consume 1 small bowl or 1 cup infusion daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Sophora mollis",
        "Local Name": "Khakhul",
        "Family": "Fabaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Seed paste",
        "Uses": "Used to control male sexual weaknesses and motion-related issues.",
        "Preparation & Dosage": "Apply seed paste externally in small amount once daily or as prescribed by traditional healer.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Mentha royleana",
        "Local Name": "Foling",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves infusion",
        "Uses": "Treats vomiting, diarrhea, dysentery, cholera, and used as a carminative.",
        "Preparation & Dosage": "Infuse 5–10 fresh leaves in hot water; drink 1–2 times a day after meals.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Peganum harmala",
        "Local Name": "Harmal",
        "Family": "Zygophyllaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Seeds",
        "Uses": "Used for cardiovascular, neurological, antimicrobial, insecticidal, antineoplastic, gastrointestinal, and antidiabetic effects.",
        "Preparation & Dosage": "Take 1–2 grams of powdered seeds with water once daily; avoid overdose.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Chenopodium album",
        "Local Name": "Snew",
        "Family": "Chenopodiaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves infusion",
        "Uses": "Used as a blood purifier, diuretic, sedative, hepatoprotective, antiscorbutic, laxative, anthelmintic. Contains contraceptive properties.",
        "Preparation & Dosage": "Boil 1 cup of leaves in water and drink 1–2 times a day.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Chenopodium botrys",
        "Local Name": "Khama",
        "Family": "Chenopodiaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Whole plant infusion",
        "Uses": "Treats coughing, pectoral complaints, abdominal pain, obstruction. Strong bactericidal and fungicidal properties.",
        "Preparation & Dosage": "Infuse 1–2 teaspoons of dried plant in hot water; consume once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Ephedra gerardiana",
        "Local Name": "Chay",
        "Family": "Ephedraceae",
        "Type": "Shrub",
        "Location": "Skardu",
        "Parts Used": "Stem decoction",
        "Uses": "Treats allergies, asthma, colds, coughs, edema, fever, flu, headaches, nasal congestion. Natural source of ephedrine and related compounds.",
        "Preparation & Dosage": "Boil small stem pieces (about 1–2 grams) in water; consume once a day. Avoid high doses.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Dracocephalum nuristanicum",
        "Local Name": "Shamddun",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Seed infusion",
        "Uses": "Used to treat fever, headaches, and digestive issues.",
        "Preparation & Dosage": "Infuse 1 teaspoon of seeds in hot water; drink once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Thymus linearis",
        "Local Name": "Tumburu",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Whole plant infusion",
        "Uses": "Used to treat dropsy, pneumonia, appetite loss, asthma, chest infections, cold, cough, fever, flatulence, gastrointestinal problems, indigestion, stomachache, and menstrual disorders.",
        "Preparation & Dosage": "Boil 1–2 teaspoons of dried plant in water; drink 1–2 times daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Swertia petiolata",
        "Local Name": "Brama",
        "Family": "Gentianaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Root paste, leaves decoction",
        "Uses": "Used in Tibetan medicine for its cooling potency, anti-inflammatory activity, as febrifuge, and as a liver tonic.",
        "Preparation & Dosage": "Apply root paste externally or drink leaf decoction (1 tsp leaves in 1 cup water) once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Gentiana olivieri",
        "Local Name": "Tikta",
        "Family": "Gentianaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Fresh leaf",
        "Uses": "Leaves used for liver, gallbladder, and stomach ailments. Also linked with Gentiana septemfida for malaria and stomach problems.",
        "Preparation & Dosage": "Crush fresh leaves; consume juice or infusion once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Geranium nepalense",
        "Local Name": "Bamik",
        "Family": "Geraniaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Fruit juice",
        "Uses": "Used for influenza, dysentery, as antiphlogistic, analgesic tonic, hemostatic, stomachic, and antidiabetic.",
        "Preparation & Dosage": "Take 1 tablespoon of fresh juice once a day.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Perovskia atriplicifolia",
        "Local Name": "Faring bursay",
        "Family": "Lamiaceae",
        "Type": "Shrub",
        "Location": "Skardu",
        "Parts Used": "Flower infusion",
        "Uses": "Used as a fortifier, antiseptic, for rheumatic pains, inflammation, leishmaniasis, and as anthelmintic. Contains terpinolene, verbenone, sabinene, terpinen-4-ol.",
        "Preparation & Dosage": "Infuse 1 tsp of flowers in hot water; drink once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Nepeta leucolaena",
        "Local Name": "Askuta",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves decoction",
        "Uses": "Contains terpenoids and phenolics. Used as antimicrobial, mosquito repellent, insecticide, larvicide, cytotoxic, anticarcinogen, antioxidant, anticonvulsant, and analgesic.",
        "Preparation & Dosage": "Boil 1 tsp leaves in water; drink once or twice daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Prunella vulgaris",
        "Local Name": "Harswa",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves decoction",
        "Uses": "Traditionally used to reduce fever, soothe sore throats, and accelerate wound healing.",
        "Preparation & Dosage": "Prepare a decoction using 1 tsp leaves in water; drink once a day.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Rhododendron anthopogon",
        "Local Name": "Chauman",
        "Family": "Ericaceae",
        "Type": "Shrub",
        "Location": "Skardu",
        "Parts Used": "Leaves infusion, flower juice",
        "Uses": "Used to treat sore throat, colds, blood disorders, bone diseases, allergies, vomiting, liver disorders, headaches, and back pain.",
        "Preparation & Dosage": "Infuse 1 tsp leaves or use fresh flower juice once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Aquilegia fragrans",
        "Local Name": "Karfo koo kuk",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Floral parts and leaves",
        "Uses": "Used for skin burns, jaundice, hepatitis, wound healing, cardiovascular and circulatory diseases.",
        "Preparation & Dosage": "Infuse 1–2 tsp of dried parts in hot water; drink once daily or apply externally as needed.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Plantago lanceolata",
        "Local Name": "Sman harswa",
        "Family": "Plantaginaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Flower infusion, leaves, seeds",
        "Uses": "Bronchodilator for throat colds; leaves treat skin irritations; seeds reduce cholesterol.",
        "Preparation & Dosage": "Drink infusion (1 tsp flowers); grind leaves for topical use; eat 1 tsp seeds with water once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Bistorta amplexicaulis",
        "Local Name": "Onbu",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Root infusion, leaf paste",
        "Uses": "Decoction and leaf paste used for wounds and dysentery. Can induce abortion.",
        "Preparation & Dosage": "Infuse 1 tsp root in water and drink once daily; apply leaf paste to wounds.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Oxyria digyna",
        "Local Name": "Span harswa",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves decoction",
        "Uses": "Leaves rich in Vitamin C used to treat scurvy. Whole plant used to treat dysentery.",
        "Preparation & Dosage": "Drink leaf decoction (1 tsp leaves in 1 cup hot water) once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Polygonum affine",
        "Local Name": "Strein mindoq",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Root decoction, flower infusion",
        "Uses": "Expectorant for cough and bronchitis, astringent for piles and diarrhea, cures urinary tract inflammation, antimicrobial against gingivitis.",
        "Preparation & Dosage": "Infuse 1 tsp flowers or boil roots in water; take once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Aconitum violaceum",
        "Local Name": "Booma",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Root decoction",
        "Uses": "Used for asthma, neural disorders, cardiac diseases, sciatica, joint pain. Has antioxidant, anti-inflammatory, analgesic effects.",
        "Preparation & Dosage": "Use very small quantity (1/4 tsp root per 1 cup water); consult expert before use due to toxicity.",
        "Side Effects / Precautions": "Highly toxic; use only under expert supervision; avoid during pregnancy."
    },
    {
        "Scientific Name": "Caltha alba",
        "Local Name": "Pilling",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Root paste",
        "Uses": "Used to remove warts, for fits, anemia, colds, rheumatism. Root is diaphoretic, emetic, and expectorant. Poultice applied to sores.",
        "Preparation & Dosage": "Apply paste externally; use decoction (1 tsp root/1 cup water) cautiously.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Potentilla argyrophylla",
        "Local Name": "Serfo harswa",
        "Family": "Rosaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Whole plant paste",
        "Uses": "Used for sore throat, menstrual cramps, PMS. Stems and leaves edible as salad.",
        "Preparation & Dosage": "Apply paste externally or eat raw leaves in moderation.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Potentilla bifurca",
        "Local Name": "Tarqan",
        "Family": "Rosaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Flower infusion",
        "Uses": "Used to treat oxidative stress, tumors, and ulcers.",
        "Preparation & Dosage": "Infuse 1 tsp dried flowers in hot water; drink once a day.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Senecio chrysanthemoides",
        "Local Name": "Api mendoq",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves decoction, root powder",
        "Uses": "Used for intestinal parasites, liver problems, irregular menstruation, and as a laxative or soothing lotion.",
        "Preparation & Dosage": "Drink decoction (1 tsp leaves per cup); apply root powder as paste externally.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Hippophae rhamnoides",
        "Local Name": "Choq",
        "Family": "Elaeagnaceae",
        "Type": "Shrub",
        "Location": "Skardu",
        "Parts Used": "Fruit juice",
        "Uses": "Used for aging, burns, eczema, acne, indigestion, blood pressure, skin health.",
        "Preparation & Dosage": "Take 1–2 tsp fresh juice daily; best on empty stomach.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Epilobium latifolium",
        "Local Name": "Pondol",
        "Family": "Onagraceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Flower paste, leaves decoction",
        "Uses": "Used for pain relief, inflammation, pimples, fevers. Has analgesic, anti-inflammatory, antipruritic effects.",
        "Preparation & Dosage": "Apply flower paste to affected area; drink leaf decoction once daily.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Primula denticulata",
        "Local Name": "Daoo",
        "Family": "Primulaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves infusion",
        "Uses": "Treats wounds, ulcers, diarrhea, internal bleeding, sore mouth.",
        "Preparation & Dosage": "Infuse 1 tsp leaves in hot water; drink 1 cup per day.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Bergenia ciliata",
        "Local Name": "Shaphus",
        "Family": "Saxifragaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves juice",
        "Uses": "Treats kidney stones, bladder, lung, liver, spleen diseases, ulcers, piles, menorrhagia, eye disorders, cough, UTI treatment, Antibacteria, dysuria, heart, lung, liver diseases, spleen enlargement, tumors, ulcers, piles, dysentery",
        "Preparation & Dosage": "Drink juice (1–2 tsp daily) or use paste for external conditions.",
        "Side Effects / Precautions": "Use cautiously; avoid during pregnancy; consult healthcare provider before use."
    },
    {
        "Scientific Name": "Mallotus philippensis",
        "Local Name": "Kambela",
        "Family": "Euphorbiaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Fruits",
        "Uses": "Used to treat skin problems, bronchitis, fungal infections, tapeworms, eye disease, cancer, diabetes, diarrhea, jaundice, malaria, and urinogenital infections.",
        "Preparation & Dosage": "Fruits are dried and powdered or boiled as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy."
    },
    {
        "Scientific Name": "Malva neglecta",
        "Local Name": "Banerak",
        "Family": "Malvaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves",
        "Uses": "Traditionally used for pain, inflammation, hemorrhoids, renal stones, constipation, and infertility.",
        "Preparation & Dosage": "Leaves boiled as tea or poultice",
        "Side Effects / Precautions": "Avoid during pregnancy."
    },
    {
        "Scientific Name": "Papaver somniferum",
        "Local Name": "Burdakha",
        "Family": "Papaveraceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Seeds",
        "Uses": "Known as opium poppy, used historically for pain relief; main compound is morphine.",
        "Preparation & Dosage": "Seeds ground or extracts prepared as tinctures",
        "Side Effects / Precautions": "Avoid during pregnancy."
    },
    {
        "Scientific Name": "Juniperus excelsa",
        "Local Name": "Chile",
        "Family": "Cupressaceae",
        "Type": "Tree",
        "Location": "Skardu",
        "Parts Used": "Leaves",
        "Uses": "Parts used to treat cough, cold, stomach cramps, asthma, dropsy, gonorrhea, leucorrhoea, skin diseases; acts as diuretic, carminative, stimulant.",
        "Preparation & Dosage": "Leaves and fruits boiled into a decoction or infusion",
        "Side Effects / Precautions": "Avoid during pregnancy."
    },
    {
        "Scientific Name": "Morus alba",
        "Local Name": "Marocho",
        "Family": "Moraceae",
        "Type": "Tree",
        "Location": "Skardu",
        "Parts Used": "Roots",
        "Uses": "Treats dizziness, insomnia, premature aging, diabetes mellitus type 2, atherosclerosis, liver and kidney disorders, and inflammation.",
        "Preparation & Dosage": "Roots decocted or leaves brewed as tea",
        "Side Effects / Precautions": "Avoid during pregnancy."
    },
    {
        "Scientific Name": "Verbascum thapsus",
        "Local Name": "Fundupal",
        "Family": "Scrophulariaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Leaves",
        "Uses": "Used for pulmonary issues, inflammatory diseases, asthma, spasmodic coughs, diarrhea, and migraines.",
        "Preparation & Dosage": "Leaves boiled as tea or used in poultices",
        "Side Effects / Precautions": "Avoid during pregnancy."
    },
    {
        "Scientific Name": "Urtica dioica",
        "Local Name": "Jami",
        "Family": "Urticaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Aerial parts",
        "Uses": "Traditionally used to manage cardiovascular disorders, especially hypertension; improves glucose homeostasis.",
        "Preparation & Dosage": "Aerial parts brewed as infusion or decoction",
        "Side Effects / Precautions": "Avoid during pregnancy."
    },
    {
        "Scientific Name": "Medicago sativa",
        "Local Name": "Ishpet",
        "Family": "Papilionaceae",
        "Type": "Herb",
        "Location": "Skardu",
        "Parts Used": "Aerial parts",
        "Uses": "Used for cholesterol, diabetes, indigestion, among other conditions; lacks strong scientific support.",
        "Preparation & Dosage": "Aerial parts boiled for tea or ground into powder",
        "Side Effects / Precautions": "Avoid during pregnancy."
    },
    {
        "Scientific Name": "Cortia depressa",
        "Local Name": "Ghang",
        "Family": "Apiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root decoction",
        "Uses": "Used to treat fever, cough, arthritis, joint pain, abdominal parasites, jaundice, snake bites, and other diseases.",
        "Preparation & Dosage": "Roots boiled to prepare decoction",
        "Side Effects / Precautions": "Avoid during pregnancy."
    },
    {
        "Scientific Name": "Allium cepa",
        "Local Name": "Chong",
        "Family": "Amaryllidaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Bulb",
        "Uses": "Widely used as antimicrobial; also has anticancer, antidiabetic, antioxidant, antiplatelet, antihypertensive, antidepressant, neuroprotective, anti-inflammatory, and antiparasitic effects.",
        "Preparation & Dosage": "Bulbs crushed, eaten raw or cooked, or brewed as tea",
        "Side Effects / Precautions": "Avoid during pregnancy."
    },
    {
        "Scientific Name": "Allium carolinianum",
        "Local Name": "Broq chong",
        "Family": "Apiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Bulb",
        "Uses": "Young leaves and stems or boiled and smashed bulbs applied to wounds and skin diseases. Bulb juice used against tuberculosis and strong cold. Used on head for colds, flu, headache, fever, toothache.",
        "Preparation & Dosage": "Bulbs boiled and smashed; juice extracted; leaves and stems applied as poultice",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause skin irritation in sensitive individuals"
    },
    {
        "Scientific Name": "Foeniculum vulgare",
        "Local Name": "Badian",
        "Family": "Apiaceae",
        "Type": "Herb",
        "Location": "all region",
        "Parts Used": "Seed",
        "Uses": "Used for digestive, endocrine, reproductive, and respiratory ailments; also as a galactagogue for lactating mothers.",
        "Preparation & Dosage": "Seed infusion: Boil 5 g seeds in 1 cup water, strain, use as eye wash or drink once daily. Crushed seeds: Apply externally around eyes for relief.",
        "Side Effects / Precautions": "Generally safe; avoid in pregnancy in large doses due to estrogenic effects."
    },
    {
        "Scientific Name": "Pimpinella diversifolia",
        "Local Name": "Kohniod",
        "Family": "Apiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Seed / Leaves",
        "Uses": "Treats cold, indigestion, diarrhea; eaten as wild vegetable; used for stomach pain, bone pain, and rheumatism.",
        "Preparation & Dosage": "Seeds and leaves boiled or used fresh as vegetables",
        "Side Effects / Precautions": "Avoid during pregnancy; excessive use may cause gastrointestinal discomfort"
    },
    {
        "Scientific Name": "Ferula jaeschkeana",
        "Local Name": "Sib",
        "Family": "Apiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Latex / Root powder",
        "Uses": "Used in folk medicine for chest pain, tumors, ulcers, and chronic wounds.",
        "Preparation & Dosage": "Latex and root powder applied externally or prepared as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause allergic reactions or photosensitivity"
    },
    {
        "Scientific Name": "Daucus carota",
        "Local Name": "Wafro",
        "Family": "Apiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Has antioxidant, analgesic, anti-inflammatory, antimicrobial, antifungal, diuretic, lithontripic, emmenagogue properties; used in Persian medicine and phytotherapy.",
        "Preparation & Dosage": "Roots boiled as decoction or eaten raw",
        "Side Effects / Precautions": "Avoid during pregnancy; possible allergic reactions in sensitive individuals"
    },
    {
        "Scientific Name": "Artemisia santolinifolia",
        "Local Name": "Kho bustae",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Branches",
        "Uses": "Used in traditional medicine for fevers, inflammation, headaches, bleeding, and malaria.",
        "Preparation & Dosage": "Branches boiled as decoction or infusion",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause allergic reactions or photosensitivity"
    },
    {
        "Scientific Name": "Tanacetum fakoneri",
        "Local Name": "N/A",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Flower",
        "Uses": "Used to treat backache and gastric troubles.",
        "Preparation & Dosage": "Flowers brewed as tea or used fresh",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause allergic reactions or stomach upset"
    },
    {
        "Scientific Name": "Taraxacum officinale",
        "Local Name": "Shantha",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Used for hypertension, diabetes, dyspepsia, irritable bowel syndrome, and ovarian androgen excess.",
        "Preparation & Dosage": "Roots boiled as decoction or eaten raw",
        "Side Effects / Precautions": "Avoid during pregnancy; possible diuretic effects; may cause allergic reactions"
    },
    {
        "Scientific Name": "Artemisia scoparia",
        "Local Name": "Khasma",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Used to treat fever, inflammation, jaundice, and infections.",
        "Preparation & Dosage": "Leaves brewed as tea or decoction",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause photosensitivity"
    },
    {
        "Scientific Name": "Berberis brandisiana",
        "Local Name": "Skiorbu",
        "Family": "Berberidaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Treats diabetes, liver problems, wounds, arthritis, infections, swelling, and tumors.",
        "Preparation & Dosage": "Leaves boiled or used as poultice",
        "Side Effects / Precautions": "Avoid during pregnancy; high doses may affect heart rhythm"
    },
    {
        "Scientific Name": "Berberis orthobotrys",
        "Local Name": "Skiorbu",
        "Family": "Berberidaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Treats eye, ear, mouth infections; aids weight loss; heals wounds; treats piles, hemorrhoids, dysentery, indigestion, uterine/vaginal disorders",
        "Preparation & Dosage": "Leaves decoction or poultice",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause digestive upset"
    },
    {
        "Scientific Name": "Berberis pseudoumbellata",
        "Local Name": "Skiorbu",
        "Family": "Berberidaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Used for treatment of jaundice.",
        "Preparation & Dosage": "Leaves boiled as tea",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Betula utilis",
        "Local Name": "Staqpa",
        "Family": "Betulaceae",
        "Type": "Tree",
        "Location": "Shiger",
        "Parts Used": "Papery bark",
        "Uses": "Used to clean wounds; also used in Ayurveda for obesity and lipid metabolism disorders.",
        "Preparation & Dosage": "Bark applied topically or decocted",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause skin irritation"
    },
    {
        "Scientific Name": "Biebersteinia odora",
        "Local Name": "Chundol",
        "Family": "Biebersteiniaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Flower",
        "Uses": "Treats bone fractures, musculoskeletal disorders; has anti-nociceptive and anti-inflammatory effects.",
        "Preparation & Dosage": "Flowers boiled or used as poultice",
        "Side Effects / Precautions": "Avoid during pregnancy; limited data on safety"
    },
    {
        "Scientific Name": "Onosma hispida",
        "Local Name": "Kangmar",
        "Family": "Boraginaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Whole plant",
        "Uses": "Treats throat infections, menstrual disorders, stomach pain, general body pain, asthma.",
        "Preparation & Dosage": "Whole plant decocted",
        "Side Effects / Precautions": "Avoid during pregnancy; potential liver toxicity in large doses"
    },
    {
        "Scientific Name": "Myosotis alpestris",
        "Local Name": "Mandoqskor",
        "Family": "Boraginaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Flower",
        "Uses": "Used as astringent poultice for wounds, bronchitis, fever, and asthma.",
        "Preparation & Dosage": "Flowers crushed or boiled",
        "Side Effects / Precautions": "Avoid during pregnancy; possible skin irritation"
    },
    {
        "Scientific Name": "Amebia guttata",
        "Local Name": "Thangmars",
        "Family": "Boraginaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Used for functions and interactions of nucleus and cytoplasm; also used for heartburn treatment (traditional use).",
        "Preparation & Dosage": "Roots boiled as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause gastrointestinal irritation"
    },
    {
        "Scientific Name": "Amebia guttata",
        "Local Name": "Thangmars",
        "Family": "Boraginaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Used traditionally for cellular functions study; also for heartburn.",
        "Preparation & Dosage": "Roots boiled or prepared as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Descurainia sophia",
        "Local Name": "Khashir",
        "Family": "Brassicaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Seed",
        "Uses": "Used for palpitation, varicose veins, varicocele, constipation, hemorrhoids, skin eruptions, and impotence.",
        "Preparation & Dosage": "Seeds boiled as tea or used in infusions",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Brassica rapa",
        "Local Name": "Mulo",
        "Family": "Brassicaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Used for headaches, chest complaints, rheumatism, edema, gonorrhea, syphilis, and rabies.",
        "Preparation & Dosage": "Roots boiled as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Kochia scoparia",
        "Local Name": "Fiangma",
        "Family": "Chenopodiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Used for skin diseases, dysuria, tiredness, and hypertension in traditional Korean medicine.",
        "Preparation & Dosage": "Leaves boiled as tea",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Juniperus excelsa",
        "Local Name": "Shukpa",
        "Family": "Cupressaceae",
        "Type": "Tree",
        "Location": "Shiger",
        "Parts Used": "Fruit",
        "Uses": "Fruits, leaves, stems, and bark used to treat cough, cold, stomach cramps, asthma, diuretic, carminative, stimulant.",
        "Preparation & Dosage": "Fruits and leaves boiled or used fresh",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Cuscuta epithymum",
        "Local Name": "Rbukthaq",
        "Family": "Cuscutaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Stem",
        "Uses": "Used for liver and kidney failure, sexual impotence, and vision weakness.",
        "Preparation & Dosage": "Stem decoction or infusion",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Elaeagnus angustifolia",
        "Local Name": "Sarsing",
        "Family": "Elaeagnaceae",
        "Type": "Tree",
        "Location": "Shiger",
        "Parts Used": "Fruit",
        "Uses": "Used as anti-ulcer remedy, for wound healing, gastric disorders, and bronchitis.",
        "Preparation & Dosage": "Fruits used fresh or boiled",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Pisum sativum",
        "Local Name": "Skabuksuk",
        "Family": "Fabaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Treats abdominal pain, joint disorders, coughs, colds, fever, eye wash for eye ache and wounds.",
        "Preparation & Dosage": "Leaves boiled or used fresh as poultice or wash",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Sophora abpecuroides",
        "Local Name": "Khakhul",
        "Family": "Fabaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Treats fever, bacterial infections, heart disease, rheumatism, gastrointestinal diseases.",
        "Preparation & Dosage": "Root boiled as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Desmodium gangeticum",
        "Local Name": "Shingnar",
        "Family": "Fabaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Used for postnatal complaints, diarrhea, chronic fever, biliousness, cough, vomiting, and asthma.",
        "Preparation & Dosage": "Root boiled as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Hedysanur fakoneri",
        "Local Name": "Kharun",
        "Family": "Fabaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Treats gastrointestinal nematode infestations; supports immune and peripheral nervous systems.",
        "Preparation & Dosage": "Root decoction",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Vicia faba",
        "Local Name": "Naqstant",
        "Family": "Fabaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Seed",
        "Uses": "Used for cancer, diabetes, cardiovascular diseases, anemia, malaria, depression.",
        "Preparation & Dosage": "Seeds boiled or made into infusion",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Trigonella leonumgraecum",
        "Local Name": "Shalmilik",
        "Family": "Fabaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Treats diabetes; seeds and leaves used in Ayurvedic medicine; also for low blood pressure and gastric troubles.",
        "Preparation & Dosage": "Leaves and seeds brewed as tea",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Corydalis adiantifolia",
        "Local Name": "Shampoo",
        "Family": "Fumariaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Used against abdominal worms; also used for migraine and fever (with Biebersteinia odora).",
        "Preparation & Dosage": "Root boiled as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Ribes orientale",
        "Local Name": "Askuta",
        "Family": "Glossulariaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Fruit",
        "Uses": "Treats rheumatism, joint pain, and abdominal worms.",
        "Preparation & Dosage": "Fruits boiled or used fresh",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Ribes himalense",
        "Local Name": "Decne/askutu",
        "Family": "Glossulariaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Fruit",
        "Uses": "Juice of leaves treats diarrhea, dysentery, and abdominal pain.",
        "Preparation & Dosage": "Leaf juice applied or taken orally",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Ribes alpestre",
        "Local Name": "Askutu",
        "Family": "Glossulariaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Fruit",
        "Uses": "Treats rheumatism, arthritis, joint pain, renal inflammation, diaphoretic, emmenagogue, diuretic, wound healing, insect bites",
        "Preparation & Dosage": "Fruits boiled or applied as poultice",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Juglans regia",
        "Local Name": "Starga",
        "Family": "Juglandaceae",
        "Type": "Tree",
        "Location": "Shiger",
        "Parts Used": "Seed",
        "Uses": "Used for helminthiasis, diarrhea, sinusitis, stomach aches, arthritis, asthma, eczema, scrofula, skin disorders",
        "Preparation & Dosage": "Seeds boiled or crushed into paste",
        "Side Effects / Precautions": "Asthma sufferers should use cautiously"
    },
    {
        "Scientific Name": "Dracocephalum nutans",
        "Local Name": "Shundur",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Used for gastric troubles and post-birth trace release",
        "Preparation & Dosage": "Leaves brewed as tea",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Coriandrum sativum",
        "Local Name": "Naqposhoto",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Seed",
        "Uses": "Relieves pain, rheumatoid arthritis, inflammation",
        "Preparation & Dosage": "Seeds brewed as tea or used as spice",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Nepeta leucolaena",
        "Local Name": "Azumal",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Treats colic, cough, diarrhea, asthma, bronchitis",
        "Preparation & Dosage": "Leaves brewed as infusion",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Mentha arvensis",
        "Local Name": "Piono",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Treats cold, fever, digestive and cardiovascular disorders",
        "Preparation & Dosage": "Leaves brewed as tea",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Thymus linearis",
        "Local Name": "Tumburu",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Treats dropsy, pneumonia, appetite loss, asthma, chest infections, cold, cough, fever",
        "Preparation & Dosage": "Leaves brewed as infusion",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Morus nigra",
        "Local Name": "Osae",
        "Family": "Moraceae",
        "Type": "Tree",
        "Location": "Shiger",
        "Parts Used": "Fruit",
        "Uses": "Has anti-obesity, anti-hyperlipidemic, and anticancer activities",
        "Preparation & Dosage": "Fruits eaten fresh or dried",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Fraxinus xanthoxyloides",
        "Local Name": "Khara",
        "Family": "Oleaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Stem / Seed",
        "Uses": "Used for pneumonia, pain, jaundice, malaria, bone fractures, internal wounds",
        "Preparation & Dosage": "Stem and seeds boiled as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Papaver nodicaule",
        "Local Name": "Kialbumand oq",
        "Family": "Papaveraceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Flower",
        "Uses": "Flowers and seeds used as mild diaphoretic in folk medicine; used for wounds, cuts, and injuries",
        "Preparation & Dosage": "Flowers and seeds applied topically",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause sedation"
    },
    {
        "Scientific Name": "Pamassia nubicula",
        "Local Name": "Darbamand oq",
        "Family": "Pamassiaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Flower",
        "Uses": "Root paste relieves cuts and wounds; leaf juice treats eye problems and inflammation",
        "Preparation & Dosage": "Root paste applied; leaf juice applied",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Plantago major",
        "Local Name": "Bokhna",
        "Family": "Plantaginaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Flowers",
        "Uses": "Used for toothache, earache, halitosis, oral lesions, mouth sores, epistaxis, hemoptysis, loose teeth, gingivitis, tonsillitis",
        "Preparation & Dosage": "Flowers brewed or applied topically",
        "Side Effects / Precautions": "May cause allergic reactions in sensitive individuals"
    },
    {
        "Scientific Name": "Acantholimon lycopodioides",
        "Local Name": "Choqmando q",
        "Family": "Plumbaginaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Flower",
        "Uses": "Treats cardiac disorders and stomach ulcer",
        "Preparation & Dosage": "Flowers boiled as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Hordeum valgare",
        "Local Name": "Nus",
        "Family": "Poaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Seedlings",
        "Uses": "Poultice for burns and wounds; anti-inflammatory",
        "Preparation & Dosage": "Seedlings applied as poultice",
        "Side Effects / Precautions": "May cause allergic reactions; avoid if hypertensive"
    },
    {
        "Scientific Name": "Triticum aestivum",
        "Local Name": "Tro",
        "Family": "Poaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Seed",
        "Uses": "Used as bread, crackers, cereals, pastries",
        "Preparation & Dosage": "Used as food",
        "Side Effects / Precautions": "Gluten sensitivity or celiac precautions"
    },
    {
        "Scientific Name": "Zea mays",
        "Local Name": "Makai",
        "Family": "Poaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Carpels",
        "Uses": "Diuretic, hepatoprotective, anti-diabetic, antioxidant",
        "Preparation & Dosage": "Carpels boiled as tea or eaten",
        "Side Effects / Precautions": "Avoid if allergic to corn products"
    },
    {
        "Scientific Name": "Rumex nepalensis",
        "Local Name": "Bashona",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Treats microbial infections, malaria, sleeping sickness, post-birth trace release",
        "Preparation & Dosage": "Leaves boiled as decoction",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Fagopyrum esculentum",
        "Local Name": "Bro",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Seed",
        "Uses": "Treats cholesterol, triglycerides, blood glucose levels, stomach ulcer",
        "Preparation & Dosage": "Seeds boiled or eaten raw",
        "Side Effects / Precautions": "Avoid if allergic to buckwheat"
    },
    {
        "Scientific Name": "Polygonum tararicum",
        "Local Name": "Khobro",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Seed",
        "Uses": "Expectorant for cough and bronchitis; used as an astringent",
        "Preparation & Dosage": "Seeds boiled as tea or used topically",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Rheum webbianum",
        "Local Name": "Khol",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Stem",
        "Uses": "Used for indigestion, abdominal disorders, boils, wounds, and flatulence",
        "Preparation & Dosage": "Stem boiled or poultice applied",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause gastrointestinal irritation"
    },
    {
        "Scientific Name": "Rumex patientia",
        "Local Name": "Rashona",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Treats pain, inflammation, bleeding, tinea, tumors, and constipation",
        "Preparation & Dosage": "Leaves boiled or poultice",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Punica granatum",
        "Local Name": "Sio",
        "Family": "Punicaceae",
        "Type": "Tree",
        "Location": "Shiger",
        "Parts Used": "Fruit",
        "Uses": "Used traditionally for ulcers, diarrhea, male infertility, fever, and vomiting",
        "Preparation & Dosage": "Fruit juice or extract",
        "Side Effects / Precautions": "May interact with some medications; use caution in pregnancy"
    },
    {
        "Scientific Name": "Aconitum violaceum",
        "Local Name": "Smunchan",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Antioxidant, anti-inflammatory, analgesic; used for asthma, cough, neuro disorders, cardiac diseases, sciatica, joint pain",
        "Preparation & Dosage": "Roots boiled or decoction",
        "Side Effects / Precautions": "Highly toxic if misused; should be used only under expert guidance"
    },
    {
        "Scientific Name": "Aconitum heterophyllum",
        "Local Name": "Buma",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Root",
        "Uses": "Expectorant, febrifuge, anthelmintic, anti-diarrhoeal, anti-emetic, anti-inflammatory; treats poisoning from scorpion/snake",
        "Preparation & Dosage": "Tubers boiled or decoction",
        "Side Effects / Precautions": "Highly toxic; expert supervision needed"
    },
    {
        "Scientific Name": "Clematis alpina",
        "Local Name": "Kuntze/ghn aghzima",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Whole plant",
        "Uses": "Treats syphilis, gout, rheumatism, bone disorders, chronic skin conditions; diuretic; used topically for blisters and wounds",
        "Preparation & Dosage": "Oral decoction and topical poultice",
        "Side Effects / Precautions": "Toxic if ingested improperly; use with caution"
    },
    {
        "Scientific Name": "Ranunculus repens",
        "Local Name": "Khsiarmand oq",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Flower",
        "Uses": "Analgesic, rubefacient; poultice used for sores, muscular aches, rheumatic pains",
        "Preparation & Dosage": "Poultice of chewed leaves",
        "Side Effects / Precautions": "Toxic if ingested; avoid internal use"
    },
    {
        "Scientific Name": "Delphinium brunonianum",
        "Local Name": "Makhoting",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Flower",
        "Uses": "Used for fever, headache, stomachache, cough, and removal of poison, Baldness, diarrhea, fever ,Fruit flesh dried; seeds eaten as almonds; fruit source of income; oil extracted for burning.\nStomach, abdominal disorders\n",
        "Preparation & Dosage": "Decoction or infusion",
        "Side Effects / Precautions": "Toxic; only use with expert guidance"
    },
    {
        "Scientific Name": "Prunus armeniaca",
        "Local Name": "Chuli",
        "Family": "Rosaceae",
        "Type": "Tree",
        "Location": "1, 2 , 3 , 4 , 5",
        "Parts Used": "Fruit/floral buds",
        "Uses": "Used for asthma, constipation, infertility; fruit juice and leaves medicinally",
        "Preparation & Dosage": "Juice or topical application",
        "Side Effects / Precautions": "Seeds contain cyanogenic compounds; avoid ingestion of wild seeds (bitter one),Kho Chuli Poisonos (ssed and Seed cake)"
    },
    {
        "Scientific Name": "Spiraeae canescens",
        "Local Name": "Khsiber",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Branches",
        "Uses": "Leaves and flowering stems are anti-inflammatory, antiseptic, aromatic, astringent, diaphoretic, diuretic, stomachic, tonic",
        "Preparation & Dosage": "Decoction or infusion",
        "Side Effects / Precautions": "Avoid if allergic to Rosaceae family"
    },
    {
        "Scientific Name": "Prunus avium",
        "Local Name": "Gilas",
        "Family": "Rosaceae",
        "Type": "Tree",
        "Location": "1, 2 , 3 , 4 , 5",
        "Parts Used": "Fruit",
        "Uses": "Astringent, diuretic, tonic; decoction treats cystitis, edema, bronchial complaints, looseness of bowels, anemia",
        "Preparation & Dosage": "Decoction of fruit stalks",
        "Side Effects / Precautions": "Avoid excess intake; possible allergic reactions"
    },
    {
        "Scientific Name": "Molus pumila",
        "Local Name": "Kushu",
        "Family": "Rosaceae",
        "Type": "Tree",
        "Location": "Shiger",
        "Parts Used": "Fruit",
        "Uses": "Infusion treats intermittent/remittent fevers, bilious disorders, gas, mucus, flux, colic, and anemia",
        "Preparation & Dosage": "Infusion of fruit",
        "Side Effects / Precautions": "Use with caution during pregnancy"
    },
    {
        "Scientific Name": "Rosa webbiana",
        "Local Name": "Sia",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Shiger",
        "Parts Used": "Root, bark, fruit",
        "Uses": "Source of essential fatty acids; investigated for cancer prevention and treatment",
        "Preparation & Dosage": "Various (infusions, decoctions, oils)",
        "Side Effects / Precautions": "Generally safe, avoid in allergic individuals"
    },
    {
        "Scientific Name": "Salix alba",
        "Local Name": "Hlchanma",
        "Family": "Salicaceae",
        "Type": "Tree",
        "Location": "Shiger",
        "Parts Used": "Leaves, inflorescence",
        "Uses": "Treats chronic/acute inflammation, infection, pain, and fever (natural source of salicin)",
        "Preparation & Dosage": "Infusion or decoction of leaves",
        "Side Effects / Precautions": "Avoid if allergic to aspirin; can cause stomach upset"
    },
    {
        "Scientific Name": "Papulus nigra",
        "Local Name": "Naqbiar",
        "Family": "Salicaceae",
        "Type": "Tree",
        "Location": "Shiger",
        "Parts Used": "Bark",
        "Uses": "Used traditionally for arthritis, rheumatism, liver disorders, and fever",
        "Preparation & Dosage": "Decoction of bark",
        "Side Effects / Precautions": "Avoid excessive use; possible stomach irritation"
    },
    {
        "Scientific Name": "Solanum nigrum",
        "Local Name": "Drumbasho khlo",
        "Family": "Solanaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Fruit",
        "Uses": "Treats bacterial infections, cough, indigestion; studied for antiproliferative, antiseizure, antioxidant, antiviral, hepatoprotective effects",
        "Preparation & Dosage": "Decoction or extract of fruits",
        "Side Effects / Precautions": "Toxic if consumed raw; process properly"
    },
    {
        "Scientific Name": "Datura fastuosa",
        "Local Name": "Datura",
        "Family": "Solanaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Leaves",
        "Uses": "Seeds used as analgesic, anthelmintic, anti-inflammatory for stomach/intestinal pain, toothache, and fever; fruit juice for dandruff",
        "Preparation & Dosage": "Seeds used in powder or decoction; juice applied topically",
        "Side Effects / Precautions": "Highly toxic if misused; expert supervision required"
    },
    {
        "Scientific Name": "Urtica dioica",
        "Local Name": "Khashoshing",
        "Family": "Urticaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Whole plant",
        "Uses": "Controls cardiovascular disorders especially hypertension; improves glucose homeostasis",
        "Preparation & Dosage": "Leaf extract or infusion",
        "Side Effects / Precautions": "May cause allergic reactions; avoid excessive use"
    },
    {
        "Scientific Name": "Viola canescens",
        "Local Name": "Skora menddoq",
        "Family": "Violaceae",
        "Type": "Herb",
        "Location": "Shiger",
        "Parts Used": "Floral part",
        "Uses": "Used for cough, cold, flu, fever, malaria; also considered anticancerous",
        "Preparation & Dosage": "Infusion of flowers",
        "Side Effects / Precautions": "Generally safe; avoid overdose"
    },
    {
        "Scientific Name": "Pithecellobium dulce",
        "Local Name": "Jilabli / ben",
        "Family": "Fabaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Bark, leaves, seed",
        "Uses": "Bark extract: chronic diarrhea, dysentery, constipation, tuberculosis; leaves: indigestion, prevent abortion, gall bladder ailments, wound healing; seed: ulcers",
        "Preparation & Dosage": "Extracts, ground seed",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Punica granatum",
        "Local Name": "Danooh",
        "Family": "Punicaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Fruit, root",
        "Uses": "Treats ulcers, diarrhea, male infertility",
        "Preparation & Dosage": "Decoction or fruit extract",
        "Side Effects / Precautions": "Generally safe"
    },
    {
        "Scientific Name": "Clematis orientalis",
        "Local Name": "Murkhushi",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Fruits, flower, leaves",
        "Uses": "Antiseptic, refrigerant; ancient use for dog bites and ulcerated throats via gargling",
        "Preparation & Dosage": "Infusion for gargling",
        "Side Effects / Precautions": "Handle with care; potential toxicity"
    },
    {
        "Scientific Name": "Fragaria nubicola",
        "Local Name": "Groose / gruzal",
        "Family": "Rosaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Root",
        "Uses": "Juice used for profuse menstruation; unripe fruit chewed for tongue blemishes",
        "Preparation & Dosage": "Juice extraction, fresh use",
        "Side Effects / Precautions": "Limited data on safety"
    },
    {
        "Scientific Name": "Artemisia maritima",
        "Local Name": "Zoon",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Seed, leaf",
        "Uses": "Treatment/prevention of fever, chills, malaria",
        "Preparation & Dosage": "Decoction or infusion",
        "Side Effects / Precautions": "Avoid in pregnancy; can be toxic in high doses"
    },
    {
        "Scientific Name": "Tragopogon dubius",
        "Local Name": "Kreel woosh",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Leaves, flowers",
        "Uses": "Used for wound healing, gastrointestinal and hepatic complaints, cancer, kidney and liver dysfunction, skin diseases",
        "Preparation & Dosage": "Decoction, poultice",
        "Side Effects / Precautions": "Use cautiously"
    },
    {
        "Scientific Name": "Berberis lyceum",
        "Local Name": "Zolg",
        "Family": "Berberidaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Leaves, fruits, roots",
        "Uses": "Antibacterial, hepatoprotective, antioxidant, wound healing, treatment for stomach, liver, skin, cough, and eye problems",
        "Preparation & Dosage": "Decoction, extract",
        "Side Effects / Precautions": "Avoid prolonged use without medical advice"
    },
    {
        "Scientific Name": "Valeriana wallichii",
        "Local Name": "Mushk bala",
        "Family": "Capparidaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Fruits",
        "Uses": "Appetizer, carminative, antispasmodic; treats abdominal pain, flatulence, gas, bloating, loss of appetite; strengthens heart muscles, lowers blood pressure",
        "Preparation & Dosage": "Decoction or extract",
        "Side Effects / Precautions": "Avoid in pregnancy, sedation effects"
    },
    {
        "Scientific Name": "Aconitum violaceum",
        "Local Name": "Buma",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Root",
        "Uses": "Antioxidant, anti-inflammatory, analgesic; used for asthma, cough, neural disorders, cardiac diseases, sciatica, joint pain",
        "Preparation & Dosage": "Root extracts",
        "Side Effects / Precautions": "Highly toxic, use with extreme care"
    },
    {
        "Scientific Name": "Allardia tomentosa",
        "Local Name": "Tarkhan",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Flowers",
        "Uses": "Used to treat fever, colds, headaches",
        "Preparation & Dosage": "Infusion or topical",
        "Side Effects / Precautions": "Use cautiously"
    },
    {
        "Scientific Name": "Allardia tridactylites",
        "Local Name": "Patkanstwa",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Whole plant",
        "Uses": "Used against parasitic infections, Alzheimer’s disease, rheumatism, hypertension, gastric disorders",
        "Preparation & Dosage": "Decoction, infusion",
        "Side Effects / Precautions": "Unknown toxicity"
    },
    {
        "Scientific Name": "Allium carolinianum",
        "Local Name": "Kachoauk",
        "Family": "Amaryllidaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Bulb, leaves",
        "Uses": "Young leaves/stems boiled or smashed applied on wounds, skin diseases; bulb juice against tuberculosis, cold; used for colds, flu, headache, fever, toothache",
        "Preparation & Dosage": "Poultice, juice",
        "Side Effects / Precautions": "Avoid excess use"
    },
    {
        "Scientific Name": "Arnebia benthamii",
        "Local Name": "Thang marsi",
        "Family": "Boraginaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Root",
        "Uses": "Used as food colorant; stimulant, tonic, diuretic, expectorant; treats tongue/throat diseases, fever, cardiac disorders",
        "Preparation & Dosage": "Syrup, jam, infusion",
        "Side Effects / Precautions": "Use moderate amounts"
    },
    {
        "Scientific Name": "Artemisia scoparia",
        "Local Name": "Khobursay",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Flowers, leaves",
        "Uses": "Treats liver diseases, inflammation, infections, fever, pain, cancer, diabetes",
        "Preparation & Dosage": "Infusion, decoction",
        "Side Effects / Precautions": "Avoid excessive use"
    },
    {
        "Scientific Name": "Berberis pseudumbellata",
        "Local Name": "Skurbu",
        "Family": "Berberidaceae",
        "Type": "Shrub",
        "Location": "Kharmong",
        "Parts Used": "Root, leaves",
        "Uses": "Antimicrobial, anti-inflammatory, hypotensive, sedative, anticonvulsant; stimulates immune system",
        "Preparation & Dosage": "Extracts, decoction",
        "Side Effects / Precautions": "Use under supervision"
    },
    {
        "Scientific Name": "Betula utilis",
        "Local Name": "Jongi",
        "Family": "Betulaceae",
        "Type": "Tree",
        "Location": "Kharmong",
        "Parts Used": "Bark",
        "Uses": "External use as styptic to stop bleeding and purulent discharge; used for cleaning wounds",
        "Preparation & Dosage": "Poultice, topical application",
        "Side Effects / Precautions": "Avoid internal use"
    },
    {
        "Scientific Name": "Bistorta affinis",
        "Local Name": "Chomoi",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Rhizome",
        "Uses": "Antipyretic, anti-inflammatory; treats fever, tonsillitis, cough, cold (Tibetan and Nepalese traditional medicine)",
        "Preparation & Dosage": "Decoction, infusion",
        "Side Effects / Precautions": "Use with caution"
    },
    {
        "Scientific Name": "Carum bulbocastanum",
        "Local Name": "Karpho thalay",
        "Family": "Apiaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Seeds",
        "Uses": "Anti-flatulent; treats flatulence, abdominal distention, bloating",
        "Preparation & Dosage": "Seed infusion, powder",
        "Side Effects / Precautions": "Possible allergic reactions"
    },
    {
        "Scientific Name": "Codonopsis clematidea",
        "Local Name": "Bajo mendoq",
        "Family": "Campanulaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Flower",
        "Uses": "Treats stomachache, leprosy, ligament issues; effective against heart diseases, high blood pressure; tranquilizer",
        "Preparation & Dosage": "Decoction, infusion",
        "Side Effects / Precautions": "Use with supervision"
    },
    {
        "Scientific Name": "Gentiana olivieri",
        "Local Name": "Tikta",
        "Family": "Gentianaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Flower",
        "Uses": "Used for liver, gallbladder, stomach ailments; decoction for malaria and stomach problems",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Hippophae rhamnoides",
        "Local Name": "Karsokh",
        "Family": "Elaeagnaceae",
        "Type": "Shrub",
        "Location": "Kharmong",
        "Parts Used": "Fruits, seeds",
        "Uses": "Traditionally used to slow aging, treat burns, eczema, acne, indigestion, hypertension, wrinkled skin; limited scientific evidence",
        "Preparation & Dosage": "Juice, oil, topical",
        "Side Effects / Precautions": "Possible allergic reactions"
    },
    {
        "Scientific Name": "Juniperus excelsa",
        "Local Name": "Shukpa",
        "Family": "Cupressaceae",
        "Type": "Tree",
        "Location": "Kharmong",
        "Parts Used": "Fruits",
        "Uses": "Used for cough, cold, stomach cramps, asthma, diuretic, stimulant, dropsy, gonorrhea, gleets, leucorrhoea, skin diseases",
        "Preparation & Dosage": "Decoction, infusion",
        "Side Effects / Precautions": "Toxic in large doses"
    },
    {
        "Scientific Name": "Ranunculus repens",
        "Local Name": "Khser mendoq",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Flowers, leaves",
        "Uses": "Poultice for sores, muscular aches, rheumatic pains; analgesic and rubefacient",
        "Preparation & Dosage": "Poultice",
        "Side Effects / Precautions": "Toxicity caution advised"
    },
    {
        "Scientific Name": "Rheum australe",
        "Local Name": "Lachu",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Root and leaves",
        "Uses": "Used for gastritis, stomach problems, blood purification, menstrual problems, liver diseases",
        "Preparation & Dosage": "Decoction, infusion",
        "Side Effects / Precautions": "Avoid overdose"
    },
    {
        "Scientific Name": "Rubia cordifolia",
        "Local Name": "Zghinoq",
        "Family": "Rubiaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Root",
        "Uses": "Used for amenorrhea, various skin disorders, renal stones, blood detoxification, skin inflammation, joint pain",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Use carefully"
    },
    {
        "Scientific Name": "Rumex hastatus",
        "Local Name": "Churki",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Root",
        "Uses": "Treats rheumatism, cough, headache, fever, tonsillitis, piles",
        "Preparation & Dosage": "Decoction, infusion",
        "Side Effects / Precautions": "Possible toxicity if misused"
    },
    {
        "Scientific Name": "Rumex nepalensis",
        "Local Name": "Hubable",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Root",
        "Uses": "Antifungal, antibacterial, purgative; moderate cytotoxicity and high phytotoxic activity",
        "Preparation & Dosage": "Extracts",
        "Side Effects / Precautions": "Use with caution"
    },
    {
        "Scientific Name": "Solanum nigrum",
        "Local Name": "Drumba shoghlo",
        "Family": "Solanaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Seeds",
        "Uses": "Treats pneumonia, aching teeth, stomach ache, tonsillitis, worms, pain, inflammation, fever, tumor",
        "Preparation & Dosage": "Decoction, infusion",
        "Side Effects / Precautions": "Toxic if overdosed"
    },
    {
        "Scientific Name": "Swertia petiolata",
        "Local Name": "Brama",
        "Family": "Gentianaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Leaves",
        "Uses": "Anti-inflammatory, febrifuge, liver tonic; treats scleritis, liver inflammation, high blood pressure, stomach inflammation",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Avoid in pregnancy"
    },
    {
        "Scientific Name": "Tanacetum falconeri",
        "Local Name": "Tyalo",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Flower",
        "Uses": "Used for body ache, fever, abdominal pain",
        "Preparation & Dosage": "Infusion, poultice",
        "Side Effects / Precautions": "Use limited amounts"
    },
    {
        "Scientific Name": "Trifolium repens",
        "Local Name": "Skabuksuk",
        "Family": "Fabaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Flowers",
        "Uses": "Treats abdominal pain, joint disorder, cough, cold, fever, used as eye wash",
        "Preparation & Dosage": "Decoction, infusion",
        "Side Effects / Precautions": "Possible allergies"
    },
    {
        "Scientific Name": "Taraxacum officinale",
        "Local Name": "Khoshmas",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Whole plant, leaves",
        "Uses": "Used to reduce high cholesterol and reverse diabetes induced by streptozotocin",
        "Preparation & Dosage": "Infusion, decoction",
        "Side Effects / Precautions": "May cause allergic reactions"
    },
    {
        "Scientific Name": "Viola serpens",
        "Local Name": "Skor mindoq",
        "Family": "Violaceae",
        "Type": "Herb",
        "Location": "Kharmong",
        "Parts Used": "Flowers",
        "Uses": "Useful in respiratory congestion, asthma, sore throat, cold, coryza, throat cancer, bleeding piles, constipation, fever, headache, skin diseases",
        "Preparation & Dosage": "Decoction, infusion",
        "Side Effects / Precautions": "Generally safe"
    },
    {
        "Scientific Name": "Abies pindrow Royle",
        "Local Name": "Paludar, Rewar",
        "Family": "Pinaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Leaves (fresh and dried), wood",
        "Uses": "Timber for construction and furniture. Decoction/tincture of dried leaves for cough, asthma, bronchitis, bladder catarrh. Fresh leaf juice given to infants for fever.",
        "Preparation & Dosage": "Leaves dried and boiled in water to make decoction; fresh juice extracted from leaves for infants",
        "Side Effects / Precautions": "Use cautiously in infants; excessive intake may cause irritation"
    },
    {
        "Scientific Name": "Artemisia absinthium Linn",
        "Local Name": "Drun",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Powder mixed with almond oil for treatment of ear diseases.",
        "Preparation & Dosage": "Plant dried and powdered, mixed with almond oil and applied externally to ear",
        "Side Effects / Precautions": "Avoid ingestion; may cause allergic reactions or toxicity if overdosed"
    },
    {
        "Scientific Name": "Artemisia indica Willd.",
        "Local Name": "Drun",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used for treatment of ear diseases and as insecticide for clothes.",
        "Preparation & Dosage": "Plant crushed and applied externally or boiled for insecticide spray",
        "Side Effects / Precautions": "External use only; avoid contact with eyes"
    },
    {
        "Scientific Name": "Berberis lycium Royle",
        "Local Name": "Sumblu",
        "Family": "Berberidaceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Roots",
        "Uses": "Root powder used as blood purifier and for skin diseases.",
        "Preparation & Dosage": "Roots dried and ground into powder, taken orally or applied as paste",
        "Side Effects / Precautions": "Not recommended during pregnancy; excessive use may cause stomach upset"
    },
    {
        "Scientific Name": "Betula utilis D. Don",
        "Local Name": "Birch",
        "Family": "Betulaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Bark",
        "Uses": "Astringent bark used in deodorants.",
        "Preparation & Dosage": "Bark dried and powdered; used externally in preparations",
        "Side Effects / Precautions": "Avoid internal use; bark may cause irritation if ingested"
    },
    {
        "Scientific Name": "Cannabis sativa Linn",
        "Local Name": "Bhang",
        "Family": "Cannabaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Stem, leaves, flowers, fruits",
        "Uses": "Resin used as narcotic, sedative, analgesic, intoxicant; fiber used by locals.",
        "Preparation & Dosage": "Resin extracted and dried; plant parts smoked or prepared in tinctures",
        "Side Effects / Precautions": "Use under supervision; high doses cause psychoactive effects"
    },
    {
        "Scientific Name": "Cedrus deodara (Roxb.) G. Don",
        "Local Name": "Deyar / Cedar",
        "Family": "Pinaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Wood",
        "Uses": "Wood used to make excellent quality furniture.",
        "Preparation & Dosage": "Wood processed for carpentry; not used medicinally",
        "Side Effects / Precautions": "None (wood only)"
    },
    {
        "Scientific Name": "Celtis australis",
        "Local Name": "Batkalar, Nettle tree",
        "Family": "Ulmaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Leaves, fruit, stem",
        "Uses": "Leaves and fruit reduce menstrual and uterine bleeding; stem used for making sticks.",
        "Preparation & Dosage": "Leaves and fruits dried for teas or eaten fresh; stems used for crafts",
        "Side Effects / Precautions": "Avoid large doses; consult before use during pregnancy"
    },
    {
        "Scientific Name": "Chenopodium album Linn.",
        "Local Name": "Bathu",
        "Family": "Chenopodiaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used as a green leafy vegetable.",
        "Preparation & Dosage": "Fresh leaves and shoots are cooked as vegetable or added to soups.",
        "Side Effects / Precautions": "Avoid excessive consumption as it contains oxalates which may affect kidney stones."
    },
    {
        "Scientific Name": "Cichorium intybus Linn.",
        "Local Name": "Kasni",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Treats fevers, diarrhea, and spleen enlargement.",
        "Preparation & Dosage": "Decoction of whole plant made by boiling in water; also fresh juice is used.",
        "Side Effects / Precautions": "Use cautiously in patients with allergy to Asteraceae family; may cause stomach upset."
    },
    {
        "Scientific Name": "Colchicum luteum Baker",
        "Local Name": "Suranjan-e-Talakh, Soorganda",
        "Family": "Colchicaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used for rheumatism, liver and spleen diseases, bronchial conditions.",
        "Preparation & Dosage": "Extracts prepared from whole plant parts; often dried and powdered for oral use under supervision.",
        "Side Effects / Precautions": "Highly toxic if overdosed; use only under expert guidance."
    },
    {
        "Scientific Name": "Coriandrum sativum Linn.",
        "Local Name": "Dhania",
        "Family": "Umbelliferae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Leaves, fruits",
        "Uses": "Used as spice and to treat stomach diseases.",
        "Preparation & Dosage": "Fresh leaves and fruits used fresh or dried; decoctions prepared from fruits for digestive issues.",
        "Side Effects / Precautions": "Generally safe; avoid excessive intake during pregnancy."
    },
    {
        "Scientific Name": "Cyperus scariosus R.Br",
        "Local Name": "Ghayakochin",
        "Family": "Cyperaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used to kill stomach worms in children.",
        "Preparation & Dosage": "Plant parts boiled to prepare decoction; administered orally in small doses.",
        "Side Effects / Precautions": "Use only recommended dose; excessive use can cause digestive irritation."
    },
    {
        "Scientific Name": "Daphne mucronata Royle",
        "Local Name": "Kutilal",
        "Family": "Thymelaeaceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Bark, fruits, seeds",
        "Uses": "Bark for bone diseases and hair washing; fruits edible; seeds for skin diseases.",
        "Preparation & Dosage": "Bark boiled to make topical wash; fruits eaten fresh; seeds ground into paste for skin application.",
        "Side Effects / Precautions": "Seeds are toxic if ingested in large amounts; handle with care."
    },
    {
        "Scientific Name": "Daucus carota Linn.",
        "Local Name": "Carrot/Gaajjar",
        "Family": "Umbelliferae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Root",
        "Uses": "Eaten as vegetable; believed to improve eyesight.",
        "Preparation & Dosage": "Roots eaten raw or cooked as vegetable; fresh juice taken for eyesight benefits.",
        "Side Effects / Precautions": "Generally safe; avoid contaminated roots from polluted soils."
    },
    {
        "Scientific Name": "Dioscorea deltoidea Wall.",
        "Local Name": "Ratalu",
        "Family": "Dioscoreaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used to expel intestinal worms and kill lice.",
        "Preparation & Dosage": "Whole plant parts crushed and applied externally; decoction for internal use prepared carefully.",
        "Side Effects / Precautions": "Can be toxic; external use preferred; avoid during pregnancy."
    },
    {
        "Scientific Name": "Diospyros lotus Linn.",
        "Local Name": "Amlok",
        "Family": "Ebenaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Fruit",
        "Uses": "Fruit edible and consumed locally.",
        "Preparation & Dosage": "Fruits eaten fresh or dried; sometimes made into preserves.",
        "Side Effects / Precautions": "Generally safe; ensure fruit is ripe to avoid digestive issues."
    },
    {
        "Scientific Name": "Echinops echinatus Roxb.",
        "Local Name": "Kandiari",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Root",
        "Uses": "Powdered root mixed with Acacia applied to hair to kill lice.",
        "Preparation & Dosage": "Roots dried, powdered and mixed with gum/acacia; applied topically on scalp.",
        "Side Effects / Precautions": "Avoid contact with eyes; test for skin sensitivity before use."
    },
    {
        "Scientific Name": "Ephedra regeliana Florin",
        "Local Name": "Bata",
        "Family": "Ephedraceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Extract",
        "Uses": "Ephedrine extract used for nasal treatment and in snuff preparation.",
        "Preparation & Dosage": "Extract prepared by drying and crushing stems; used in nasal drops or snuff form.",
        "Side Effects / Precautions": "Use with caution; may cause increased heart rate and hypertension; avoid long-term use."
    },
    {
        "Scientific Name": "Ferula assa-foetida Regel",
        "Local Name": "Hing",
        "Family": "Umbelliferae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Root",
        "Uses": "Hing (resin) used medicinally, as flavoring, and for rheumatic pain.",
        "Preparation & Dosage": "Resin extracted from root; small quantities dissolved in warm water or oil and applied or ingested carefully.",
        "Side Effects / Precautions": "Use in small doses; may cause digestive upset or allergic reactions in sensitive people."
    },
    {
        "Scientific Name": "Fraxinus xanthoxyloides (G.Don) DC",
        "Local Name": "Sum / Ashtree",
        "Family": "Oleaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Stem, wood",
        "Uses": "Wood/stem used for high-quality furniture.",
        "Preparation & Dosage": "Wood harvested and processed for carpentry and furniture making.",
        "Side Effects / Precautions": "Not used medicinally; handle wood dust carefully to avoid respiratory irritation."
    },
    {
        "Scientific Name": "Fumaria indica Lam.",
        "Local Name": "Paapra",
        "Family": "Fumariaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used as blood purifier and to treat skin diseases.",
        "Preparation & Dosage": "Whole plant dried and powdered or boiled for decoction; applied topically for skin problems.",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause gastrointestinal irritation if overdosed."
    },
    {
        "Scientific Name": "Cedrus deodara (Roxb.) G. Don",
        "Local Name": "Deyar / Cedar",
        "Family": "Pinaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Wood",
        "Uses": "Wood is excellent for making furniture.",
        "Preparation & Dosage": "Wood is harvested, seasoned, and crafted into furniture or construction materials.",
        "Side Effects / Precautions": "Not used medicinally; avoid inhalation of sawdust which can irritate respiratory tract."
    },
    {
        "Scientific Name": "Celtis australis",
        "Local Name": "Batkalar, Nettle tree",
        "Family": "Ulmaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Leaves, fruit, stem",
        "Uses": "Leaves and fruit reduce menstrual and uterine bleeding; stem used for making sticks.",
        "Preparation & Dosage": "Leaves and fruit are dried and prepared as herbal infusions or powders; stems used as raw material for sticks.",
        "Side Effects / Precautions": "Use cautiously during pregnancy due to uterine effects; ensure proper identification."
    },
    {
        "Scientific Name": "Chenopodium album Linn.",
        "Local Name": "Bathu",
        "Family": "Chenopodiaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used as a green leafy vegetable.",
        "Preparation & Dosage": "Fresh leaves cooked as a vegetable or dried and powdered for medicinal teas.",
        "Side Effects / Precautions": "Avoid excessive intake due to presence of oxalates; can cause kidney stones if overconsumed."
    },
    {
        "Scientific Name": "Cichorium intybus Linn.",
        "Local Name": "Kasni",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used in treatment of fevers, diarrhea, and enlargement of spleen.",
        "Preparation & Dosage": "Whole plant boiled to prepare decoction or infusion taken orally.",
        "Side Effects / Precautions": "Avoid in pregnancy; may cause allergic reactions in sensitive individuals."
    },
    {
        "Scientific Name": "Colchicum luteum Baker",
        "Local Name": "Suranjan-e-Talakh, Soorganda",
        "Family": "Colchicaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Remedy for rheumatism, liver and spleen diseases, also used for bronchial issues.",
        "Preparation & Dosage": "Whole plant extracts prepared as tinctures or decoctions; dosed carefully due to toxicity.",
        "Side Effects / Precautions": "Highly toxic if overdosed; do not self-medicate without expert guidance; avoid during pregnancy."
    },
    {
        "Scientific Name": "Coriandrum sativum Linn.",
        "Local Name": "Dhania",
        "Family": "Umbelliferae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Leaves, fruits",
        "Uses": "Leaves and fruits used as spice and for treating stomach diseases.",
        "Preparation & Dosage": "Fresh or dried leaves/fruits added to food or brewed as tea for digestive benefits.",
        "Side Effects / Precautions": "Generally safe; avoid excessive use during pregnancy."
    },
    {
        "Scientific Name": "Cyperus scariosus R.Br",
        "Local Name": "Ghayakochin",
        "Family": "Cyperaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used for killing stomach worms in children.",
        "Preparation & Dosage": "Whole plant boiled to prepare decoction for oral use.",
        "Side Effects / Precautions": "Use only under supervision; high doses may cause nausea or toxicity."
    },
    {
        "Scientific Name": "Daphne mucronata Royle",
        "Local Name": "Kutilal",
        "Family": "Thymelaeaceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Bark, fruits, seeds",
        "Uses": "Bark used for bone diseases and hair washing; fruits edible; seeds used for skin diseases.",
        "Preparation & Dosage": "Bark made into decoction or paste; seeds powdered for topical use; fruits consumed fresh.",
        "Side Effects / Precautions": "Seeds can be toxic if ingested in large amounts; handle with care."
    },
    {
        "Scientific Name": "Daucus carota Linn.",
        "Local Name": "Carrot / Gaajjar",
        "Family": "Umbelliferae",
        "Type": "Herb",
        "Location": "All regions",
        "Parts Used": "Root",
        "Uses": "Edible as vegetable and believed to improve eyesight.",
        "Preparation & Dosage": "Roots consumed raw or cooked as vegetable; juice used traditionally for eyesight.",
        "Side Effects / Precautions": "Generally safe; avoid excessive intake in some with allergies to related plants."
    },
    {
        "Scientific Name": "Dioscorea deltoidea Wall.",
        "Local Name": "Ratalu",
        "Family": "Dioscoreaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used to expel intestinal worms and kill lice.",
        "Preparation & Dosage": "Whole plant dried and powdered or boiled for decoction; topical application for lice.",
        "Side Effects / Precautions": "Toxic if misused; do not ingest large quantities; use under expert supervision."
    },
    {
        "Scientific Name": "Diospyros lotus Linn.",
        "Local Name": "Amlok",
        "Family": "Ebenaceae",
        "Type": "Tree",
        "Location": "all regions",
        "Parts Used": "Fruit",
        "Uses": "The fruit is edible by locals.",
        "Preparation & Dosage": "Fruits are consumed fresh or dried; sometimes made into jams or preserves.",
        "Side Effects / Precautions": "Generally safe; avoid overconsumption to prevent digestive upset."
    },
    {
        "Scientific Name": "Echinops echinatus Roxb.",
        "Local Name": "Kandiari",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Roots",
        "Uses": "Powdered roots mixed with Acacia applied to hair to kill lice.",
        "Preparation & Dosage": "Roots dried and powdered, mixed with Acacia gum or oil, then applied topically to scalp.",
        "Side Effects / Precautions": "Avoid contact with eyes; discontinue if irritation occurs."
    },
    {
        "Scientific Name": "Ephedra regeliana Florin",
        "Local Name": "Bata",
        "Family": "Ephedraceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Extract",
        "Uses": "Ephedrine extract used for nasal treatment; mixed with tobacco for snuff.",
        "Preparation & Dosage": "Extract obtained by drying and macerating plant parts; used as nasal drops or mixed with tobacco for snuff.",
        "Side Effects / Precautions": "Should be used cautiously; ephedrine can cause increased heart rate and hypertension."
    },
    {
        "Scientific Name": "Ephedra gerardiana Wall.",
        "Local Name": "Bata",
        "Family": "Ephedraceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Extract",
        "Uses": "Used for nasal drops and treatment of cough and cold.",
        "Preparation & Dosage": "Extract prepared as tincture or nasal drops from dried plant parts.",
        "Side Effects / Precautions": "Same as above; avoid overuse and use under medical supervision."
    },
    {
        "Scientific Name": "Elaeagnus angustifolia Linn.",
        "Local Name": "Shanjur",
        "Family": "Elaeagnaceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Flowers, fruit",
        "Uses": "Flowers fragrant; fruit used to treat cough and cold, and as ingredient in joshanda.",
        "Preparation & Dosage": "Flowers and fruits dried and added to herbal tea mixtures (joshanda) or used fresh for cough relief.",
        "Side Effects / Precautions": "Generally safe; avoid excess consumption during pregnancy."
    },
    {
        "Scientific Name": "Fraxinus xanthoxyloides (G.Don) DC",
        "Local Name": "Sum / Ashtree",
        "Family": "Oleaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Stem, wood",
        "Uses": "Wood used for best quality furniture.",
        "Preparation & Dosage": "Wood harvested, seasoned, and used in furniture making.",
        "Side Effects / Precautions": "Not used medicinally; avoid inhalation of sawdust."
    },
    {
        "Scientific Name": "Fumaria indica Lam.",
        "Local Name": "Paapra",
        "Family": "Fumariaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used as blood purifier and to treat skin diseases.",
        "Preparation & Dosage": "Whole plant dried and powdered or made into decoction for oral and topical use.",
        "Side Effects / Precautions": "Avoid in pregnancy; may cause gastrointestinal upset if overdosed."
    },
    {
        "Scientific Name": "Hippophae rhamnoides Linn.",
        "Local Name": "Mirghiz, Seabuck thorn",
        "Family": "Elaeagnaceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Fruit, oil",
        "Uses": "Fruit rich in vitamin C; oil used in cosmetics. Syrup from berries treats lung and stomach complaints; berries used in jams and drinks.",
        "Preparation & Dosage": "Berries harvested fresh or dried; syrup prepared by boiling berries with sugar; oil cold-pressed or extracted from fruit.",
        "Side Effects / Precautions": "Avoid excess use; high doses may cause digestive upset."
    },
    {
        "Scientific Name": "Hyoscyamus niger Linn.",
        "Local Name": "Ajwain-e-Khurasaani",
        "Family": "Solanaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used as narcotic and antiseptic; treats asthma and whooping cough.",
        "Preparation & Dosage": "Whole plant dried and powdered or extracted for tincture; used under medical supervision due to toxicity.",
        "Side Effects / Precautions": "Toxic in high doses; avoid self-medication and use only with expert guidance."
    },
    {
        "Scientific Name": "Indigofera heterantha",
        "Local Name": "Kainthi",
        "Family": "Papilionaceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Branches, extract",
        "Uses": "Branches used for basket making; plant extract used for epilepsy and neuropathy.",
        "Preparation & Dosage": "Branches collected for crafts; extract prepared by maceration or decoction for medicinal use.",
        "Side Effects / Precautions": "Extract should be used cautiously; avoid if allergic to legumes."
    },
    {
        "Scientific Name": "Melia azadirachta",
        "Local Name": "Dhraek",
        "Family": "Meliaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Fruit, leaves, bark",
        "Uses": "Fruit and leaves treat boils and skin diseases; used for hair growth; bark is bitter tonic and astringent.",
        "Preparation & Dosage": "Leaves and fruit crushed for poultices; bark decoction used orally; leaf oil applied topically.",
        "Side Effects / Precautions": "Avoid during pregnancy; toxic if ingested in large quantities."
    },
    {
        "Scientific Name": "Juglans regia Linn.",
        "Local Name": "Akhrott/Birmo",
        "Family": "Juglandaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Fruit",
        "Uses": "Fruit is edible, sweet, emollient, aphrodisiac, tonic, and carminative.",
        "Preparation & Dosage": "Fruits eaten raw or roasted; oil extracted for tonic use.",
        "Side Effects / Precautions": "Avoid allergy to nuts; excessive use may cause digestive discomfort."
    },
    {
        "Scientific Name": "Juniperus excelsa Linn.",
        "Local Name": "Chuch, Petthar",
        "Family": "Pinaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Berries, oil, stem, leaves, wood",
        "Uses": "Ripe berries treat catarrhal inflammation, urinary issues; oil is carminative, stimulant, diuretic; dried wood/leaves used as fuel.",
        "Preparation & Dosage": "Berries dried or used fresh in decoction; oil extracted by steam distillation; wood used for fuel and crafts.",
        "Side Effects / Precautions": "Avoid during pregnancy; possible kidney irritation if overused."
    },
    {
        "Scientific Name": "Mentha sylvestris Linn.",
        "Local Name": "Podeena",
        "Family": "Labiatae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Leaves",
        "Uses": "Carminative; cooling medicine; flavoring; used in local chutney preparation.",
        "Preparation & Dosage": "Leaves harvested fresh; dried or used fresh in cooking and herbal preparations.",
        "Side Effects / Precautions": "Generally safe; may cause heartburn in sensitive individuals."
    },
    {
        "Scientific Name": "Morus nigra",
        "Local Name": "Kala toot, Shahtoot, Toot-e-siah",
        "Family": "Moraceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Fruit",
        "Uses": "Edible fruit; economic importance; used for sore throat relief.",
        "Preparation & Dosage": "Fruits eaten fresh or dried; juice or decoction used for sore throat.",
        "Side Effects / Precautions": "Avoid in case of allergy to mulberry; excessive consumption may cause diarrhea."
    },
    {
        "Scientific Name": "Morus alba Linn.",
        "Local Name": "Chitta toot, Lailan",
        "Family": "Moraceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Used for cough and facial dropsy treatment.",
        "Preparation & Dosage": "Leaves and fruits dried for decoction or tea.",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause allergic reactions in some people."
    },
    {
        "Scientific Name": "Nerium odorum Soland.",
        "Local Name": "Kaner",
        "Family": "Apocynaceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Leaves, oil",
        "Uses": "Leaves used to treat piles; oil preparation for skin diseases and leprosy.",
        "Preparation & Dosage": "Leaves crushed for topical application; oil extracted for medicinal use on skin.",
        "Side Effects / Precautions": "Highly toxic if ingested; use only externally with caution."
    },
    {
        "Scientific Name": "Peganum harmala Linn.",
        "Local Name": "Harmal",
        "Family": "Zygophyllaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Seeds, leaves, smoke",
        "Uses": "Seed powder used for asthma, colic, jaundice, tapeworms, and reducing temperature in chronic malaria; narcotic seeds; smoke antiseptic for wound fumigation; blood purifier with olive oil; leaves for rheumatic pain.",
        "Preparation & Dosage": "Seeds powdered and taken orally or burned for smoke fumigation; leaves crushed for topical application; olive oil mixed for blood purification.",
        "Side Effects / Precautions": "Toxic in high doses; avoid during pregnancy; use under supervision due to narcotic properties."
    },
    {
        "Scientific Name": "Pimpinella stewartii (Dunn) E. Nasir",
        "Local Name": "Tarpakhi",
        "Family": "Umbelliferae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Roots, fruits",
        "Uses": "Roots scented; fruits used as carminative and for other stomach ailments.",
        "Preparation & Dosage": "Roots dried and used in decoction or infusion; fruits powdered or boiled for carminative effect.",
        "Side Effects / Precautions": "Avoid excess use; possible allergic reactions."
    },
    {
        "Scientific Name": "Plantago lanceolata Linn.",
        "Local Name": "Ispagol",
        "Family": "Plantaginaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Leaves, seeds",
        "Uses": "Leaves cooling, alternative, and diuretic; seeds cure stomach disorders; tea used for coughs, ulcers, irritable bowel, cystitis, and painful urination.",
        "Preparation & Dosage": "Decoction: simmer ½ cup fresh or dried leaves in 2-3 cups water for 30-40 mins; drink 1-2 cups daily. Seeds soaked or powdered for medicinal use.",
        "Side Effects / Precautions": "Generally safe; increase water intake to avoid constipation when taking seeds."
    },
    {
        "Scientific Name": "Plantago major Linn.",
        "Local Name": "Ispagol",
        "Family": "Plantaginaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Leaves",
        "Uses": "Leaves diuretic; treats inflammation of mucous membranes of gastrointestinal and urinary tracts; used in chronic dysentery, diarrhea, constipation; powdered seed with vinegar and castor oil for headaches.",
        "Preparation & Dosage": "Leaves crushed for topical application or boiled for tea; powdered seed mixed with vinegar and castor oil for topical use.",
        "Side Effects / Precautions": "Generally safe; avoid allergic reactions."
    },
    {
        "Scientific Name": "Prunus domestica Linn.",
        "Local Name": "Lucha",
        "Family": "Rosaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Fruit",
        "Uses": "Used with other drugs for irregular menstruation and debility after miscarriage; laxative and refrigerant.",
        "Preparation & Dosage": "Fruits eaten fresh or dried; used in decoctions combined with other herbs for menstruation support.",
        "Side Effects / Precautions": "Avoid during pregnancy unless advised by physician."
    },
    {
        "Scientific Name": "Punica granatum Linn.",
        "Local Name": "Druna, Anar",
        "Family": "Punicaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Fruit, seeds, bark, wood",
        "Uses": "Fruit edible; juice tonic for fever; dried seeds for flavoring; bark and wood used against tapeworms; also for diarrhea, dysentery, carminative, stomach diseases; condiment use.",
        "Preparation & Dosage": "Juice extracted fresh; seeds dried and powdered; bark decoction prepared for antiparasitic use; fruit consumed fresh or dried.",
        "Side Effects / Precautions": "Avoid excess seed ingestion; possible allergic reactions."
    },
    {
        "Scientific Name": "Ribes himalense Decne",
        "Local Name": "Kaala Meva",
        "Family": "Crassulaceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Berries",
        "Uses": "Edible berries; sold for jams, cakes, etc.; laxative properties.",
        "Preparation & Dosage": "Berries eaten fresh or processed into jams and preserves.",
        "Side Effects / Precautions": "Excess use may cause diarrhea; avoid in sensitive individuals."
    },
    {
        "Scientific Name": "Ricinus communis Linn.",
        "Local Name": "Arund",
        "Family": "Euphorbiaceae",
        "Type": "Shrub",
        "Location": "Deosi",
        "Parts Used": "Seeds (oil)",
        "Uses": "Oil from seeds used as purgative (castor oil).",
        "Preparation & Dosage": "Seeds cold-pressed to extract oil; oil taken orally as purgative under medical advice.",
        "Side Effects / Precautions": "Seeds are highly toxic; only purified oil used medicinally; avoid self-medication."
    },
    {
        "Scientific Name": "Rumex dentatus",
        "Local Name": "Khatimal",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Deosi",
        "Parts Used": "Whole plant",
        "Uses": "Mild laxative; treats chronic gastrointestinal diseases.",
        "Preparation & Dosage": "Whole plant boiled to prepare decoction or infusion for internal use.",
        "Side Effects / Precautions": "Avoid during pregnancy and lactation; high doses may cause stomach irritation."
    },
    {
        "Scientific Name": "Salix caprea Linn.",
        "Local Name": "Baid",
        "Family": "Salicaceae",
        "Type": "Tree",
        "Location": "Deosi",
        "Parts Used": "Stems, flowers, leaves",
        "Uses": "Cardiac tonic; water distillate of stems and flowers is cordial; leaves applied externally for headache relief.",
        "Preparation & Dosage": "Distillate prepared from stems and flowers; leaves crushed for topical application.",
        "Side Effects / Precautions": "Use with caution in those allergic to salicylates; avoid overdose."
    },
    {
        "Scientific Name": "Artemisia brevifolia",
        "Local Name": "Wormwood",
        "Family": "(Not specified)",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan (Baltistan)",
        "Parts Used": "Aerial parts",
        "Uses": "Malaria treatment, Digestive aid, Antiparasitic",
        "Preparation & Dosage": "Decoction: Boil 5g dried leaves in 1 cup water for 10 minutes; drink 1 cup daily for 7 days",
        "Side Effects / Precautions": "May cause nausea or allergic reactions; avoid during pregnancy and breastfeeding"
    },
    {
        "Scientific Name": "Rheum emodi",
        "Local Name": "Himalayan Rhubarb",
        "Family": "(Not specified)",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan (Hunza)",
        "Parts Used": "Root",
        "Uses": "Constipation relief, Liver detox, Anti-inflammatory",
        "Preparation & Dosage": "Powder: 1-2g dried root powder mixed with warm water once daily; or decoction of root",
        "Side Effects / Precautions": "Can cause abdominal cramps or diarrhea in excess; avoid in pregnancy"
    },
    {
        "Scientific Name": "Ephedra gerardiana",
        "Local Name": "Joint Fir",
        "Family": "(Not specified)",
        "Type": "Shrub",
        "Location": "Gilgit-Baltistan (Baltistan)",
        "Parts Used": "Stem and leaves",
        "Uses": "Asthma relief, Stimulant, Cold remedy",
        "Preparation & Dosage": "Infusion: 3-5g dried stem boiled in water; drink 1 cup thrice daily",
        "Side Effects / Precautions": "Avoid in hypertension, heart disease, pregnancy; may cause insomnia or palpitations"
    },
    {
        "Scientific Name": "Hippophae rhamnoides",
        "Local Name": "Sea Buckthorn",
        "Family": "(Not specified)",
        "Type": "Shrub",
        "Location": "Gilgit-Baltistan (Hunza)",
        "Parts Used": "Berries",
        "Uses": "Immune booster, Skin repair, Antioxidant",
        "Preparation & Dosage": "Juice: Fresh berries crushed; 20-30 ml daily, or mixed in honey",
        "Side Effects / Precautions": "Generally safe; may cause mild digestive upset in some people"
    },
    {
        "Scientific Name": "Juglans regia",
        "Local Name": "Walnut",
        "Family": "(Not specified)",
        "Type": "Tree",
        "Location": "Gilgit-Baltistan (Hunza)",
        "Parts Used": "Leaves, nuts",
        "Uses": "Brain health, Antifungal, Dye production",
        "Preparation & Dosage": "Nut consumption: Eat raw or roasted nuts; leaves used as poultice for fungal infections",
        "Side Effects / Precautions": "Nuts may trigger allergies; avoid excessive consumption"
    },
    {
        "Scientific Name": "Thymus linearis",
        "Local Name": "Himalayan Thyme",
        "Family": "(Not specified)",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan (Baltistan)",
        "Parts Used": "Aerial parts",
        "Uses": "Cough suppressant, Antiseptic, Food preservative",
        "Preparation & Dosage": "Tea: Steep 2g dried herb in hot water for 10 minutes; drink 2 cups daily",
        "Side Effects / Precautions": "High doses may cause dizziness or stomach upset"
    },
    {
        "Scientific Name": "Taraxacum officinale",
        "Local Name": "Dandelion",
        "Family": "(Not specified)",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan (Hunza)",
        "Parts Used": "Whole plant",
        "Uses": "Liver cleanse, Diuretic, Coffee substitute",
        "Preparation & Dosage": "Decoction: Boil 5-10g whole plant in water; drink 1 cup daily",
        "Side Effects / Precautions": "May cause allergic reactions in those sensitive to ragweed family; avoid if gallstones present"
    },
    {
        "Scientific Name": "Urtica dioica",
        "Local Name": "Nettle",
        "Family": "(Not specified)",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan (Baltistan)",
        "Parts Used": "Leaves",
        "Uses": "Arthritis relief, Iron deficiency, Hair tonic",
        "Preparation & Dosage": "Infusion: Steep 5g dried leaves in hot water; drink 1-2 cups daily",
        "Side Effects / Precautions": "Fresh plant may cause skin irritation; caution with anticoagulant medications"
    },
    {
        "Scientific Name": "Rosa webbiana",
        "Local Name": "Wild Rose",
        "Family": "(Not specified)",
        "Type": "Shrub",
        "Location": "Gilgit-Baltistan (Baltistan)",
        "Parts Used": "Petals, hips",
        "Uses": "Cold prevention, Skin toner, Jam production",
        "Preparation & Dosage": "Petal infusion for tonic; hips made into jam or syrup; dosage varies",
        "Side Effects / Precautions": "Generally safe; allergic reactions possible"
    },
    {
        "Scientific Name": "Saussurea costus",
        "Local Name": "Kuth",
        "Family": "(Not specified)",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan (Hunza)",
        "Parts Used": "Root",
        "Uses": "Asthma treatment, Perfumery, Traditional incense",
        "Preparation & Dosage": "Powdered root mixed in warm water or milk; 1-2g daily",
        "Side Effects / Precautions": "Endangered species; use sustainably; possible allergic reactions"
    },
    {
        "Scientific Name": "Podophyllum hexandrum",
        "Local Name": "Himalayan Mayapple",
        "Family": "(Not specified)",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan (Baltistan)",
        "Parts Used": "Rhizome",
        "Uses": "Cancer research, Wart removal, Purgative",
        "Preparation & Dosage": "External use only; powdered rhizome applied on warts; internal use is dangerous",
        "Side Effects / Precautions": "Highly toxic; do not ingest internally; handle with care"
    },
    {
        "Scientific Name": "Valeriana jatamansi",
        "Local Name": "Indian Valerian",
        "Family": "(Not specified)",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan (Hunza)",
        "Parts Used": "Root",
        "Uses": "Anxiety relief, Sleep aid, Epilepsy treatment",
        "Preparation & Dosage": "Decoction: Boil 5g root in water; drink 1 cup before sleep",
        "Side Effects / Precautions": "May cause drowsiness; avoid operating machinery after use"
    },
    {
        "Scientific Name": "Berberis lycium",
        "Local Name": "Indian Barberry",
        "Family": "(Not specified)",
        "Type": "Shrub",
        "Location": "Gilgit-Baltistan (Baltistan)",
        "Parts Used": "Bark, roots",
        "Uses": "Eye infections, Diabetes support, Yellow dye",
        "Preparation & Dosage": "Decoction of bark; dosage 1 cup twice daily",
        "Side Effects / Precautions": "Avoid in pregnancy; high doses may cause stomach upset"
    },
    {
        "Scientific Name": "Trigonella foenum-graecum",
        "Local Name": "Fenugreek",
        "Family": "(Not specified)",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan (Hunza)",
        "Parts Used": "Seeds",
        "Uses": "Lactation aid, Blood sugar control, Hair mask",
        "Preparation & Dosage": "Seeds boiled in water; drink 1 cup daily; seeds powdered for topical hair use",
        "Side Effects / Precautions": "May cause hypoglycemia; avoid if allergic to peanuts or chickpeas"
    },
    {
        "Scientific Name": "Glycyrrhiza glabra",
        "Local Name": "Licorice",
        "Family": "(Not specified)",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan (Baltistan)",
        "Parts Used": "Root",
        "Uses": "Sore throat, Adrenal support, Natural sweetener",
        "Preparation & Dosage": "Decoction: Boil 3-5g root; drink 1 cup 2 times daily",
        "Side Effects / Precautions": "Excess may cause high blood pressure, hypokalemia; avoid prolonged use"
    },
    {
        "Scientific Name": "Malus domestica (Golden Apple)",
        "Local Name": "Phul",
        "Family": "Rosaceae",
        "Type": "Tree / Fruit",
        "Location": "Kharmong",
        "Parts Used": "Fruit",
        "Uses": "Immunity boost, heart health, hydration",
        "Preparation & Dosage": "Eat raw, juice, or bake; 1-2 apples daily",
        "Side Effects / Precautions": "High natural sugars — moderate for diabetics"
    },
    {
        "Scientific Name": "Prunus avium (Wild Cherry)",
        "Local Name": "Gilaas",
        "Family": "Rosaceae",
        "Type": "Tree / Fruit",
        "Location": "all regions of GB",
        "Parts Used": "Fruit",
        "Uses": "Anti-inflammation, sleep aid, antioxidants",
        "Preparation & Dosage": "Eat fresh or make jam; handful (15-20 cherries)",
        "Side Effects / Precautions": "Pits contain cyanide — do not crush"
    },
    {
        "Scientific Name": "Morus nigra (Black Mulberry)",
        "Local Name": "Toot",
        "Family": "Moraceae",
        "Type": "Tree / Fruit",
        "Location": "Rondu",
        "Parts Used": "Fruit",
        "Uses": "Blood health, constipation relief, antioxidants",
        "Preparation & Dosage": "Eat fresh, dried, or syrup; 1 cup fresh berries",
        "Side Effects / Precautions": "May stain clothes or surfaces"
    },
    {
        "Scientific Name": "Juglans regia (Walnut)",
        "Local Name": "Doom",
        "Family": "Juglandaceae",
        "Type": "Tree / Nut",
        "Location": "All region of GB",
        "Parts Used": "Nut kernel",
        "Uses": "Brain health, hair growth, omega-3 fatty acids",
        "Preparation & Dosage": "Eat raw or soak overnight; 2-3 kernels daily",
        "Side Effects / Precautions": "High calories — moderate intake"
    },
    {
        "Scientific Name": "Aconitum napellus var. rotundifolium",
        "Local Name": "Booma",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Wound healing, boils",
        "Preparation & Dosage": "Boil 5g of dried aerial parts in 1 cup water. Take once daily.",
        "Side Effects / Precautions": "Avoid during pregnancy. Consult a physician before use."
    },
    {
        "Scientific Name": "Artemisia fragrans",
        "Local Name": "Kho Bursay",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Endoparasites",
        "Preparation & Dosage": "Boil 5g of aerial parts in 1 cup water. Take once daily.",
        "Side Effects / Precautions": "Avoid during pregnancy. Consult a physician before use."
    },
    {
        "Scientific Name": "Artemisia rutifolia",
        "Local Name": "Kho Bursay",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Stomach disorders",
        "Preparation & Dosage": "Prepare as decoction: Boil 5g of dried part in 1 cup water. Take daily.",
        "Side Effects / Precautions": "Avoid during pregnancy. Consult a physician before use."
    },
    {
        "Scientific Name": "Valeriana wallichii",
        "Local Name": "Musik-bala",
        "Family": "Valerianaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Rhizomes",
        "Uses": "Toothache",
        "Preparation & Dosage": "Decoction: Boil 5g rhizomes in 1 cup water; drink once daily",
        "Side Effects / Precautions": "Avoid during pregnancy; may cause drowsiness"
    },
    {
        "Scientific Name": "Bursa papillosa",
        "Local Name": "Angaroo",
        "Family": "Brassicaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Leaves",
        "Uses": "Skin disorders",
        "Preparation & Dosage": "Paste leaves and apply topically",
        "Side Effects / Precautions": "Avoid contact with eyes"
    },
    {
        "Scientific Name": "Carum bulbocastanum",
        "Local Name": "Thally",
        "Family": "Apiaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Seeds",
        "Uses": "Digestive problems, diarrhea",
        "Preparation & Dosage": "Infusion: Soak seeds in hot water, drink after meals",
        "Side Effects / Precautions": "May cause stomach upset if taken excessively"
    },
    {
        "Scientific Name": "Cuscuta reflexa",
        "Local Name": "Ghbul thag",
        "Family": "Cuscutaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Urine problems, constipation",
        "Preparation & Dosage": "Decoction: Boil whole plant, drink once daily",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Dracocephalum nuristanicum",
        "Local Name": "Shamdan",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Seeds",
        "Uses": "Gastrointestinal disorders",
        "Preparation & Dosage": "Decoction of seeds, drink daily",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Ephedra gerardiana",
        "Local Name": "Say",
        "Family": "Ephedraceae",
        "Type": "Shrub",
        "Location": "Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Toothache, asthma, expectorant",
        "Preparation & Dosage": "Chew fresh aerial parts or prepare infusion",
        "Side Effects / Precautions": "Use cautiously; may raise blood pressure"
    },
    {
        "Scientific Name": "Hippophae rhamnoides",
        "Local Name": "Soq",
        "Family": "Elaeagnaceae",
        "Type": "Shrub",
        "Location": "Baltistan",
        "Parts Used": "Leaves, fruits, seeds",
        "Uses": "High blood pressure, diabetes",
        "Preparation & Dosage": "Juice of fruits 20ml daily",
        "Side Effects / Precautions": "Generally safe, avoid excess consumption"
    },
    {
        "Scientific Name": "Mentha royleana",
        "Local Name": "Foling",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Leaves",
        "Uses": "Stomachache, cold, cough",
        "Preparation & Dosage": "Infusion of fresh leaves, drink warm",
        "Side Effects / Precautions": "Avoid if allergic to mint"
    },
    {
        "Scientific Name": "Mentha arvensis",
        "Local Name": "Peeno",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Leaves",
        "Uses": "Stomach disorders, expectorant",
        "Preparation & Dosage": "Infusion of leaves, drink warm",
        "Side Effects / Precautions": "Avoid if sensitive to menthol"
    },
    {
        "Scientific Name": "Nepeta leucolaena",
        "Local Name": "Azumal",
        "Family": "Lamiaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Constipation, stomach problems",
        "Preparation & Dosage": "Decoction of whole plant, drink once daily",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Polygonum hydropiper",
        "Local Name": "Thangmaroy",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Heart trouble, respiratory problems",
        "Preparation & Dosage": "Infusion of aerial parts, drink daily",
        "Side Effects / Precautions": "Use with caution in heart patients"
    },
    {
        "Scientific Name": "Potentilla bifurca",
        "Local Name": "Tarqan",
        "Family": "Rosaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Stomachache, nausea",
        "Preparation & Dosage": "Decoction of aerial parts, drink as needed",
        "Side Effects / Precautions": "Avoid prolonged use"
    },
    {
        "Scientific Name": "Sophora mollis",
        "Local Name": "Khakhol",
        "Family": "Leguminosae",
        "Type": "Shrub",
        "Location": "Baltistan",
        "Parts Used": "Seeds, leaves",
        "Uses": "Hepatitis",
        "Preparation & Dosage": "Decoction of seeds and leaves, drink daily",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Tanacetum senectonis",
        "Local Name": "Hiltereo/Tialo",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Floral parts",
        "Uses": "High blood pressure, digestive disorders",
        "Preparation & Dosage": "Decoction of floral parts, drink once daily",
        "Side Effects / Precautions": "Avoid in pregnancy and liver disorders"
    },
    {
        "Scientific Name": "Thalictrum foetidum",
        "Local Name": "Montyrum",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Roots",
        "Uses": "Ophthalmia, gastritis",
        "Preparation & Dosage": "Decoction of roots, use as eye wash or drink",
        "Side Effects / Precautions": "Avoid contact with eyes if allergic"
    },
    {
        "Scientific Name": "Oxyria digyna",
        "Local Name": "Skyurbuaq",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Jaundice, thirst problems",
        "Preparation & Dosage": "Decoction of aerial parts, drink as needed",
        "Side Effects / Precautions": "Use cautiously; may interact with liver medications"
    },
    {
        "Scientific Name": "Viola canescens",
        "Local Name": "Stora mindoq",
        "Family": "Violaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Floral parts",
        "Uses": "Sore throat, cough",
        "Preparation & Dosage": "Infusion of floral parts, drink warm",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Trigonella foenum-graecum",
        "Local Name": "Shamilik",
        "Family": "Leguminosae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Stomach problems",
        "Preparation & Dosage": "Decoction of whole plant, drink once daily",
        "Side Effects / Precautions": "May lower blood sugar; monitor diabetic patients"
    },
    {
        "Scientific Name": "Taraxacum officinale",
        "Local Name": "Shantha",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Flowers, leaves",
        "Uses": "Arthritis",
        "Preparation & Dosage": "Infusion of flowers and leaves, drink daily",
        "Side Effects / Precautions": "Avoid in case of allergy to daisies"
    },
    {
        "Scientific Name": "Rosa webbiana",
        "Local Name": "Sia marpho",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Baltistan",
        "Parts Used": "Floral parts, bark",
        "Uses": "Skin inflammation",
        "Preparation & Dosage": "Paste of floral parts applied topically",
        "Side Effects / Precautions": "Avoid if allergic to roses"
    },
    {
        "Scientific Name": "Rosa indica",
        "Local Name": "Ghulab",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Baltistan",
        "Parts Used": "Floral parts",
        "Uses": "Constipation, abdominal problems",
        "Preparation & Dosage": "Infusion of floral parts, drink warm",
        "Side Effects / Precautions": "Avoid excess consumption"
    },
    {
        "Scientific Name": "Polygonum tataricum",
        "Local Name": "Bro-Kho-Bro",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Leaves, seeds",
        "Uses": "High blood pressure, diabetes, skin disorders",
        "Preparation & Dosage": "Decoction of leaves and seeds, drink daily",
        "Side Effects / Precautions": "Avoid if allergic to buckwheat"
    },
    {
        "Scientific Name": "Fagopyrum esculentum",
        "Local Name": "Ghiawas, sta-Bro",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Leaves, seeds",
        "Uses": "Gastric disorders, high blood pressure",
        "Preparation & Dosage": "Decoction of leaves and seeds, drink daily",
        "Side Effects / Precautions": "Use cautiously in gluten-sensitive individuals"
    },
    {
        "Scientific Name": "Aquilegia fragrans",
        "Local Name": "Karfo Koo-kuk",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Leaves, floral parts",
        "Uses": "Boils, wound healing",
        "Preparation & Dosage": "Paste applied topically; decoction for wounds",
        "Side Effects / Precautions": "Toxic if ingested in large amounts"
    },
    {
        "Scientific Name": "Berberis lyceum",
        "Local Name": "Skyruboo",
        "Family": "Berberidaceae",
        "Type": "Shrub",
        "Location": "Baltistan",
        "Parts Used": "Leaves, fruits, bark",
        "Uses": "Internal disorders, stomach problems",
        "Preparation & Dosage": "Decoction of leaves and bark, drink daily",
        "Side Effects / Precautions": "Avoid in pregnancy and with kidney disorders"
    },
    {
        "Scientific Name": "Peganum harmala",
        "Local Name": "Isman",
        "Family": "Zygophyllaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Seeds",
        "Uses": "Skin disorders",
        "Preparation & Dosage": "Paste applied topically",
        "Side Effects / Precautions": "Toxic; avoid ingestion"
    },
    {
        "Scientific Name": "Megasea ciliata",
        "Local Name": "Shaphur/Shapus",
        "Family": "Saxifragaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Roots, leaves",
        "Uses": "Wound healing, heart problems",
        "Preparation & Dosage": "Decoction of roots and leaves, drink daily",
        "Side Effects / Precautions": "Avoid in pregnancy; may interact with heart meds"
    },
    {
        "Scientific Name": "Rumex chalepensis",
        "Local Name": "Sa-shing",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Roots",
        "Uses": "Skin problems",
        "Preparation & Dosage": "Paste applied topically",
        "Side Effects / Precautions": "Avoid prolonged use"
    },
    {
        "Scientific Name": "Plantago major",
        "Local Name": "Bogna",
        "Family": "Plantaginaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Seeds",
        "Uses": "Chronic dysentery",
        "Preparation & Dosage": "Decoction of seeds, drink daily",
        "Side Effects / Precautions": "Generally safe"
    },
    {
        "Scientific Name": "Allium cepa",
        "Local Name": "Song",
        "Family": "Alliaceae",
        "Type": "Herb",
        "Location": "Baltistan",
        "Parts Used": "Bulbs, leaves",
        "Uses": "Boils, skin infections, antimicrobial",
        "Preparation & Dosage": "Crushed bulb poultice: Apply externally on boils twice daily. Fresh juice: Apply to infected skin areas.",
        "Side Effects / Precautions": "May cause skin irritation or allergic reactions in sensitive individuals. Avoid contact with eyes."
    },
  {
  "Scientific Name": "Poa stewartii",
  "Local Name": "N/A",
  "Family": "Poaceae",
  "Type": "Grass",
  "Location": "High-altitude alpine regions (e.g., Western Himalayan alpine pastures) — commonly co-occurring with Poa alpina" ,
  "Parts Used": "N/A",
  "Uses": "N/A (no documented medicinal or edible uses found)",
  "Preparation & Dosage": "N/A",
  "Side Effects / Precautions": "N/A"
},
{
  "Scientific Name": "Poa alpina",
  "Local Name": "Alpine meadow-grass, Alpine bluegrass",
  "Family": "Poaceae",
  "Type": "Grass",
  "Location": "Holarctic distribution—commonly found in Arctic and alpine zones; known from Western Himalayas, Iceland, North America, etc.",
  "Parts Used": "N/A",
  "Uses": "Not known for medicinal or edible use; no widely documented applications",
  "Preparation & Dosage": "N/A",
  "Side Effects / Precautions": "N/A"
},
    {
        "Scientific Name": "Ephedra (Ma Huang)",
        "Local Name": "Ma Huang",
        "Family": "Ephedraceae",
        "Type": "Shrub",
        "Location": "China, Global",
        "Parts Used": "Aerial parts",
        "Uses": "Relieves respiratory distress, asthma, and nasal congestion.",
        "Preparation & Dosage": "Decoction or tea made from dried stems.",
        "Side Effects / Precautions": "Avoid in hypertension; may cause side effects like palpitations."
    },
    {
        "Scientific Name": "Turmeric (Curcuma longa)",
        "Local Name": "Haldi",
        "Family": "Zingiberaceae",
        "Type": "Herb",
        "Location": "India, Asia",
        "Parts Used": "Rhizome",
        "Uses": "Anti-inflammatory, promotes wound healing, and has antimicrobial properties.",
        "Preparation & Dosage": "Paste (mixed with water or oil) for wounds; powder added to food or drinks.",
        "Side Effects / Precautions": "Safe in moderation; excessive use may cause stomach upset."
    },
    {
        "Scientific Name": "Black Pepper (Piper nigrum)",
        "Local Name": "Kali Mirch",
        "Family": "Piperaceae",
        "Type": "Vine",
        "Location": "India, Tropics",
        "Parts Used": "Fruit (peppercorns)",
        "Uses": "Reduces fever, aids digestion, and purifies blood.",
        "Preparation & Dosage": "Powdered in food or decoction with honey.",
        "Side Effects / Precautions": "May irritate stomach if taken in excess."
    },
    {
        "Scientific Name": "Sandalwood (Santalum album)",
        "Local Name": "Chandan",
        "Family": "Santalaceae",
        "Type": "Tree",
        "Location": "India, Southeast Asia",
        "Parts Used": "Heartwood, oil",
        "Uses": "Acts as an astringent and antiseptic; treats skin infections.",
        "Preparation & Dosage": "Paste (with water) for topical use; oil for aromatherapy.",
        "Side Effects / Precautions": "Avoid internal use of non-food-grade oil."
    },
    {
        "Scientific Name": "Aloe Vera (Aloe barbadensis)",
        "Local Name": "Gheekumari",
        "Family": "Asphodelaceae",
        "Type": "Succulent",
        "Location": "Global",
        "Parts Used": "Gel from leaves",
        "Uses": "Heals burns, wounds, and skin irritation.",
        "Preparation & Dosage": "Fresh gel applied topically; juice for digestion.",
        "Side Effects / Precautions": "Oral use in excess may cause diarrhea."
    },
    {
        "Scientific Name": "Cinnamon (Cinnamomum verum)",
        "Local Name": "Dalchini",
        "Family": "Lauraceae",
        "Type": "Tree",
        "Location": "Sri Lanka, India",
        "Parts Used": "Bark",
        "Uses": "Acts as an astringent, aids digestion, and helps regulate blood sugar.",
        "Preparation & Dosage": "Powder in teas or food; decoction for cough.",
        "Side Effects / Precautions": "High doses may cause liver damage."
    },
    {
        "Scientific Name": "Marshmallow Root (Althaea officinalis)",
        "Local Name": "Khatmi",
        "Family": "Malvaceae",
        "Type": "Herb",
        "Location": "Europe, Asia",
        "Parts Used": "Root",
        "Uses": "Soothes stomach acidity, coughs, and inflammation.",
        "Preparation & Dosage": "Decoction or cold infusion.",
        "Side Effects / Precautions": "Safe; may slow sugar absorption."
    },
    {
        "Scientific Name": "Ginseng (Panax ginseng)",
        "Local Name": "Ashwagandha (Indian variety)",
        "Family": "Araliaceae",
        "Type": "Herb",
        "Location": "Asia, North America",
        "Parts Used": "Root",
        "Uses": "Boosts immunity, reduces fatigue, and acts as an adaptogen.",
        "Preparation & Dosage": "Tea, powder, or capsules.",
        "Side Effects / Precautions": "Avoid in hypertension; may interact with medications."
    },
    {
        "Scientific Name": "Hyoscyamus niger",
        "Local Name": "Henbane, Bazarbung, Ajwain-i-khurasani",
        "Family": "Solanaceae",
        "Type": "Annual Herb",
        "Location": "Astore Valley, Gilgit-Baltistan",
        "Parts Used": "Flowers, Leaves, Seeds",
        "Uses": "Sedative, pain relief, treatment for asthma and nervous disorders",
        "Preparation & Dosage": "Decoction or powdered form; seeds smoked or ingested in small doses",
        "Side Effects / Precautions": "Highly toxic; use only under professional supervision; avoid during pregnancy"
    },
    {
        "Scientific Name": "Pedicularis spp",
        "Local Name": "–",
        "Family": "Scrophulariaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Flowers, Leaves",
        "Uses": "Respiratory issues, fever reduction",
        "Preparation & Dosage": "Infusion or decoction",
        "Side Effects / Precautions": "Limited toxicity data; use with caution"
    },
    {
        "Scientific Name": "Arctium lappa",
        "Local Name": "Burdock, Chero",
        "Family": "Compositae",
        "Type": "Biennial Herb",
        "Location": "Astore Valley, Gilgit-Baltistan",
        "Parts Used": "Roots, Leaves",
        "Uses": "Blood purifier, skin conditions (eczema, acne), digestive aid",
        "Preparation & Dosage": "Decoction of roots; leaves applied as poultice",
        "Side Effects / Precautions": "May cause allergic reactions in sensitive individuals"
    },
    {
        "Scientific Name": "Dactylorhiza hatagirea",
        "Local Name": "Marsh Orchid, Nar mada, Salib Punja",
        "Family": "Orchidaceae",
        "Type": "Perennial Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Roots",
        "Uses": "Aphrodisiac, tonic for weakness, treatment for diarrhea and dysentery",
        "Preparation & Dosage": "Powdered root mixed with milk or water",
        "Side Effects / Precautions": "Overharvesting threatens species; sustainable use advised"
    },
    {
        "Scientific Name": "Rhodiola wallichiana",
        "Local Name": "Rhodiola",
        "Family": "Crassulaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Roots",
        "Uses": "Adaptogen, reduces fatigue, enhances endurance, treats altitude sickness",
        "Preparation & Dosage": "Decoction or tincture",
        "Side Effects / Precautions": "Avoid in autoimmune diseases; consult doctor before use"
    },
    {
        "Scientific Name": "Aconitum violaceum",
        "Local Name": "Monk’s Hood",
        "Family": "Ranunculaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Roots",
        "Uses": "Pain relief (joints, nerves), fever reducer",
        "Preparation & Dosage": "Extremely diluted paste or decoction (highly processed)",
        "Side Effects / Precautions": "Highly poisonous; improper preparation can be fatal; use only by experts"
    },
    {
        "Scientific Name": "Corydalis spp",
        "Local Name": "–",
        "Family": "Fumariaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Roots",
        "Uses": "Pain relief, sedative, treatment for insomnia",
        "Preparation & Dosage": "Decoction or tincture",
        "Side Effects / Precautions": "Contains alkaloids; use in moderation"
    },
    {
        "Scientific Name": "Hypericum perforatum",
        "Local Name": "St. John’s Wort",
        "Family": "Guttiferae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Flowers, Leaves",
        "Uses": "Antidepressant, wound healing, nerve pain relief",
        "Preparation & Dosage": "Oil infusion for topical use; tea for internal use",
        "Side Effects / Precautions": "Photosensitivity risk; interacts with many medications"
    },
    {
        "Scientific Name": "Rubus irritans",
        "Local Name": "Climbing Blackberry",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Leaves, Fruits",
        "Uses": "Digestive issues, wound healing, anti-inflammatory",
        "Preparation & Dosage": "Tea from leaves; fruit consumed fresh or as jam",
        "Side Effects / Precautions": "Thorns may cause physical injury; handle with care"
    },
    {
        "Scientific Name": "Bergenia stracheyi",
        "Local Name": "Heart-leaved Bergenia",
        "Family": "Saxifragaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Roots, Leaves",
        "Uses": "Kidney stones, urinary tract infections, anti-inflammatory",
        "Preparation & Dosage": "Decoction of roots; leaf paste for topical use",
        "Side Effects / Precautions": "High doses may cause stomach upset"
    },
    {
        "Scientific Name": "Rosa webbianum",
        "Local Name": "Wild Rose",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Flowers, Fruits",
        "Uses": "Vitamin C source, digestive aid, skin tonic",
        "Preparation & Dosage": "Rose hip tea; flower infusion",
        "Side Effects / Precautions": "Thorny stems require careful handling"
    },
    {
        "Scientific Name": "Carduus nutans",
        "Local Name": "Musk Thistle",
        "Family": "Compositae",
        "Type": "Biennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Flowers, Leaves",
        "Uses": "Liver tonic, digestive aid",
        "Preparation & Dosage": "Tea or tincture",
        "Side Effects / Precautions": "Spiny leaves require careful handling"
    },
    {
        "Scientific Name": "Sedum spp",
        "Local Name": "Stonecrop",
        "Family": "Crassulaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Leaves",
        "Uses": "Wound healing, skin inflammation",
        "Preparation & Dosage": "Fresh leaf poultice or juice",
        "Side Effects / Precautions": "Mild toxicity in some species; avoid internal use without guidance"
    },
    {
        "Scientific Name": "Meconopsis spp",
        "Local Name": "Blue Poppy",
        "Family": "Papaveraceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Flowers",
        "Uses": "Pain relief, sedative",
        "Preparation & Dosage": "Limited traditional use; research ongoing",
        "Side Effects / Precautions": "Contains alkaloids; use with caution"
    },
    {
        "Scientific Name": "Nepeta spp",
        "Local Name": "Catnip",
        "Family": "Lamiaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Leaves, Flowers",
        "Uses": "Sedative, digestive aid, cold remedy",
        "Preparation & Dosage": "Tea or infusion",
        "Side Effects / Precautions": "Mild effects; safe for most adults"
    },
    {
        "Scientific Name": "Scutellaria spp",
        "Local Name": "Skullcap",
        "Family": "Labiatae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Leaves",
        "Uses": "Nerve tonic, anxiety relief, anti-inflammatory",
        "Preparation & Dosage": "Tea or tincture",
        "Side Effects / Precautions": "Avoid during pregnancy"
    },
    {
        "Scientific Name": "Ligularia spp",
        "Local Name": "–",
        "Family": "Compositae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Leaves, Roots",
        "Uses": "Respiratory support, anti-inflammatory",
        "Preparation & Dosage": "Decoction or poultice",
        "Side Effects / Precautions": "Potential skin irritant in some species"
    },
    {
        "Scientific Name": "Potentilla spp",
        "Local Name": "Cinquefoil",
        "Family": "Rosaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Roots, Leaves",
        "Uses": "Astringent, anti-diarrheal, wound healing",
        "Preparation & Dosage": "Decoction or topical application",
        "Side Effects / Precautions": "Generally safe; excessive use may cause constipation"
    },
    {
        "Scientific Name": "Scabiosa spp",
        "Local Name": "Pincushion Flower",
        "Family": "Dipsacaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Flowers, Roots",
        "Uses": "Skin conditions, mild sedative",
        "Preparation & Dosage": "Infusion or poultice",
        "Side Effects / Precautions": "Limited toxicity data; use moderately"
    },
    {
        "Scientific Name": "Saussurea simpsoniana",
        "Local Name": "Phen Kamal",
        "Family": "Compositae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Whole plant",
        "Uses": "Anti-inflammatory, fever reducer",
        "Preparation & Dosage": "Decoction or powder",
        "Side Effects / Precautions": "Rare plant; sustainable harvesting crucial"
    },
    {
        "Scientific Name": "Podophyllum hexandrum",
        "Local Name": "Himalayan Mandrake",
        "Family": "Podophyllaceae",
        "Type": "Perennial Herb",
        "Location": "Himalayas",
        "Parts Used": "Roots, Resin",
        "Uses": "Treatment for warts, tumors, and liver disorders",
        "Preparation & Dosage": "Resin applied topically; root extract used in minute doses",
        "Side Effects / Precautions": "Toxic; causes severe poisoning if ingested raw; restricted use in many countries"
    },
    {
        "Scientific Name": "Anaphalis nepalensis",
        "Local Name": "Pearly Everlasting",
        "Family": "Asteraceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Flowers",
        "Uses": "Wound healing, anti-inflammatory",
        "Preparation & Dosage": "Poultice or infusion",
        "Side Effects / Precautions": "Generally safe for external use"
    },
    {
        "Scientific Name": "Delphinium brunonianum",
        "Local Name": "Musk Larkspur",
        "Family": "Ranunculaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Flowers, Leaves",
        "Uses": "Insect repellent, treatment for lice and scabies",
        "Preparation & Dosage": "Crushed leaves applied topically; floral infusion for parasites",
        "Side Effects / Precautions": "Toxic if ingested; avoid contact with eyes"
    },
    {
        "Scientific Name": "Allardia stoliczkae",
        "Local Name": "–",
        "Family": "Asteraceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Flowers, Leaves",
        "Uses": "Traditional uses not well-documented; research needed",
        "Preparation & Dosage": "Limited information available",
        "Side Effects / Precautions": "Unknown safety profile; use with caution"
    },
    {
        "Scientific Name": "Thymus linearis",
        "Local Name": "Wild Thyme",
        "Family": "Labiatae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Leaves",
        "Uses": "Antiseptic, respiratory aid, digestive support",
        "Preparation & Dosage": "Tea or essential oil",
        "Side Effects / Precautions": "Generally safe; avoid in pregnancy in large doses"
    },
    {
        "Scientific Name": "Malva spp",
        "Local Name": "Mallow",
        "Family": "Malvaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Leaves, Flowers",
        "Uses": "Soothing for irritated skin and mucous membranes",
        "Preparation & Dosage": "Poultice or tea",
        "Side Effects / Precautions": "Very safe; no known precautions"
    },
    {
        "Scientific Name": "Polemonium spp",
        "Local Name": "Jacob’s Ladder",
        "Family": "Polemoniaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Roots",
        "Uses": "Traditional uses not well-documented",
        "Preparation & Dosage": "Limited information available",
        "Side Effects / Precautions": "Unknown safety profile"
    },
    {
        "Scientific Name": "Ribes alpestre",
        "Local Name": "Himalayan Gooseberry",
        "Family": "Grossulariaceae",
        "Type": "Shrub",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Fruits",
        "Uses": "Vitamin C source, digestive aid",
        "Preparation & Dosage": "Eaten fresh or made into preserves",
        "Side Effects / Precautions": "Thorns require careful handling"
    },
    {
        "Scientific Name": "Artemisia maritima",
        "Local Name": "Santonica",
        "Family": "Compositae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Flowers",
        "Uses": "Anthelmintic (expels intestinal worms)",
        "Preparation & Dosage": "Powdered flowers in small doses",
        "Side Effects / Precautions": "Toxic in large doses; use under guidance"
    },
    {
        "Scientific Name": "Bistorta affinis",
        "Local Name": "Himalayan Fleeceflower",
        "Family": "Polygonaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Roots",
        "Uses": "Astringent, diarrhea treatment",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "High tannin content; may cause constipation in excess"
    },
    {
        "Scientific Name": "Euphorbia thomsoniana",
        "Local Name": "–",
        "Family": "Euphorbiaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Latex",
        "Uses": "Traditional uses not well-documented; toxic",
        "Preparation & Dosage": "Not recommended for internal use",
        "Side Effects / Precautions": "Highly toxic; causes severe irritation; avoid use"
    },
    {
        "Scientific Name": "Swertia petiolata",
        "Local Name": "–",
        "Family": "Gentianaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Whole plant",
        "Uses": "Bitter tonic, digestive stimulant",
        "Preparation & Dosage": "Infusion",
        "Side Effects / Precautions": "Very bitter; may cause nausea in high doses"
    },
    {
        "Scientific Name": "Epilobium spp",
        "Local Name": "Fireweed",
        "Family": "Onagraceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Leaves",
        "Uses": "Prostate health, anti-inflammatory",
        "Preparation & Dosage": "Tea",
        "Side Effects / Precautions": "Generally safe"
    },
    {
        "Scientific Name": "Lamium spp",
        "Local Name": "Dead Nettle",
        "Family": "Lamiaceae",
        "Type": "Perennial Herb",
        "Location": "Astore Valley, Himalayas",
        "Parts Used": "Leaves",
        "Uses": "Astringent, wound healing",
        "Preparation & Dosage": "Poultice or tea",
        "Side Effects / Precautions": "Generally safe"
    },
    {
        "Scientific Name": "Ephedra (Ma Huang)",
        "Local Name": "Ma Huang",
        "Family": "Ephedraceae",
        "Type": "Shrub",
        "Location": "China, Global",
        "Parts Used": "Aerial parts",
        "Uses": "Respiratory distress, asthma, nasal congestion",
        "Preparation & Dosage": "Decoction or tea made from dried stems",
        "Side Effects / Precautions": "Avoid in hypertension; risk of side effects like palpitations"
    },
    {
        "Scientific Name": "Turmeric",
        "Local Name": "Haldi",
        "Family": "Zingiberaceae",
        "Type": "Herb",
        "Location": "India, Asia",
        "Parts Used": "Rhizome",
        "Uses": "Anti-inflammatory, wound healing, antimicrobial",
        "Preparation & Dosage": "Paste (mixed with water/oil) for wounds; powder added to food or drinks",
        "Side Effects / Precautions": "Safe in moderation; excessive use may cause stomach upset"
    },
    {
        "Scientific Name": "Black Pepper",
        "Local Name": "Kali Mirch",
        "Family": "Piperaceae",
        "Type": "Vine",
        "Location": "India, Tropics",
        "Parts Used": "Fruit (peppercorns)",
        "Uses": "Fever reduction, digestive aid, blood purifier",
        "Preparation & Dosage": "Powdered in food or decoction with honey",
        "Side Effects / Precautions": "May irritate stomach in excess"
    },
    {
        "Scientific Name": "Sandalwood",
        "Local Name": "Chandan",
        "Family": "Santalaceae",
        "Type": "Tree",
        "Location": "India, Southeast Asia",
        "Parts Used": "Heartwood, oil",
        "Uses": "Astringent, antiseptic, treats skin infections",
        "Preparation & Dosage": "Paste (with water) for topical use; oil for aromatherapy",
        "Side Effects / Precautions": "Avoid internal use of non-food-grade oil"
    },
    {
        "Scientific Name": "Aloe Vera",
        "Local Name": "Gheekumari",
        "Family": "Asphodelaceae",
        "Type": "Succulent",
        "Location": "Global",
        "Parts Used": "Gel from leaves",
        "Uses": "Heals burns, wounds, skin irritation",
        "Preparation & Dosage": "Fresh gel applied topically; juice for digestion",
        "Side Effects / Precautions": "Oral use in excess may cause diarrhea"
    },
    {
        "Scientific Name": "Cinnamon",
        "Local Name": "Dalchini",
        "Family": "Lauraceae",
        "Type": "Tree",
        "Location": "Sri Lanka, India",
        "Parts Used": "Bark",
        "Uses": "Astringent, digestive aid, blood sugar regulation",
        "Preparation & Dosage": "Powder in teas/food; decoction for cough",
        "Side Effects / Precautions": "High doses may cause liver damage"
    },
    {
        "Scientific Name": "Marshmallow Root",
        "Local Name": "Khatmi",
        "Family": "Malvaceae",
        "Type": "Herb",
        "Location": "Europe, Asia",
        "Parts Used": "Root",
        "Uses": "Soothes stomach acidity, coughs, and inflammation",
        "Preparation & Dosage": "Decoction or cold infusion",
        "Side Effects / Precautions": "Safe; may slow sugar absorption"
    },
    {
        "Scientific Name": "Ginseng",
        "Local Name": "Ashwagandha (Indian variety)",
        "Family": "Araliaceae",
        "Type": "Herb",
        "Location": "Asia, North America",
        "Parts Used": "Root",
        "Uses": "Boosts immunity, reduces fatigue, adaptogen",
        "Preparation & Dosage": "Tea, powder, or capsules",
        "Side Effects / Precautions": "Avoid in hypertension; may interact with medications"
    },
    {
        "Scientific Name": "Artemisia maritima",
        "Local Name": "Zoon (Shina), Afsantheen (Urdu)",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Leaves, flowers",
        "Uses": "Anthelmintic (especially for children), earache, dandruff, boils",
        "Preparation & Dosage": "Juice, ointment, poultice",
        "Side Effects / Precautions": "Use cautiously—flowers juice potentially irritant (pjsir.org, PMC)"
    },
    {
        "Scientific Name": "Artemisia annua",
        "Local Name": "—",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Malaria, fever, cough, diarrhea; perfume oil",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "No specific precautions noted"
    },
    {
        "Scientific Name": "Artemisia brevifolia",
        "Local Name": "—",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Gastronomic herb, sheep fodder",
        "Preparation & Dosage": "Not specified",
        "Side Effects / Precautions": "No specific precautions noted"
    },
    {
        "Scientific Name": "Artemisia dubia",
        "Local Name": "—",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Gastric issues, intestinal worms, wounds, skin infections",
        "Preparation & Dosage": "Leaf powder, fresh paste",
        "Side Effects / Precautions": "No specific precautions noted"
    },
    {
        "Scientific Name": "Artemisia herba-alba",
        "Local Name": "—",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Diabetes, cooling, muscle pain, fumigation",
        "Preparation & Dosage": "Decoction, powder",
        "Side Effects / Precautions": "No specific precautions noted"
    },
    {
        "Scientific Name": "Artemisia scoparia",
        "Local Name": "—",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Ear pain, burns (smoke), goat fodder",
        "Preparation & Dosage": "Smoke, direct use",
        "Side Effects / Precautions": "No specific precautions noted"
    },
    {
        "Scientific Name": "Elaeagnus angustifolia",
        "Local Name": "Ghundair / Ghindawar (Shina)",
        "Family": "Elaeagnaceae",
        "Type": "Tree",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Fruits, gum",
        "Uses": "Sore throat, cough, flu, cold, fever; asthma (gum)",
        "Preparation & Dosage": "Raw/boiled, gum extract",
        "Side Effects / Precautions": "No specific precautions noted"
    },
    {
        "Scientific Name": "Berberis lyceum",
        "Local Name": "Ishkeen, Ishkin (Gilgit), Sumbal (Urdu)",
        "Family": "Berberidaceae",
        "Type": "Shrub",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Roots, fruits, leaves",
        "Uses": "Rheumatism, gout, bodyache, diabetes; bone healing, wound treatment",
        "Preparation & Dosage": "Decoction, poultice",
        "Side Effects / Precautions": "External use may irritate; bitter taste"
    },
    {
        "Scientific Name": "Juniperus excelsa",
        "Local Name": "Chilli (Gilgit), Padum (Urdu)",
        "Family": "Cupressaceae",
        "Type": "Tree",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Berries",
        "Uses": "Tuberculosis, diabetes, joint pain; skin issues",
        "Preparation & Dosage": "Smoke, paste",
        "Side Effects / Precautions": "Use cautiously on inflamed skin"
    },
    {
        "Scientific Name": "Hippophae rhamnoides",
        "Local Name": "Buru (Shina)",
        "Family": "Asteraceae",
        "Type": "Shrub",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Fruit, leaves, stem",
        "Uses": "Cough syrup, skin/lung issues, ulcers, diabetes, blood pressure",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Highly acidic—may irritate stomach or skin"
    },
    {
        "Scientific Name": "Ephedra gerardiana",
        "Local Name": "Sopat, Soopt, Sopt (Shina), Asmani boti (Urdu)",
        "Family": "Ephedraceae",
        "Type": "Shrub",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Stem, fruit",
        "Uses": "Fracture healing, pain relief, joint issues",
        "Preparation & Dosage": "Boiled juice, ash poultice",
        "Side Effects / Precautions": "Potential stimulant; avoid in hypertension or heart conditions"
    },
    {
        "Scientific Name": "Plantago major",
        "Local Name": "Not specified",
        "Family": "Plantaginaceae",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Seeds, leaves",
        "Uses": "Skin inflammation, ulcers, dysentery, kidney disorders",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Rumex hastatus",
        "Local Name": "Not specified",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Leaves, roots",
        "Uses": "Carminative, stomachic, purgative",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Rosa indica",
        "Local Name": "Not specified",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Flower",
        "Uses": "Eye disease, fever, stomachache, pneumonia",
        "Preparation & Dosage": "Oil extract",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Rosa macrophylla",
        "Local Name": "Not specified",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Fruits",
        "Uses": "Vitamin source",
        "Preparation & Dosage": "Eaten raw",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Saussurea lappa",
        "Local Name": "Not specified",
        "Family": "Asteraceae",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Roots",
        "Uses": "Cattle heart disease, toothache, insecticide",
        "Preparation & Dosage": "Powdered root",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Solanum nigrum",
        "Local Name": "Not specified",
        "Family": "Solanaceae",
        "Type": "Herb",
        "Location": "Gilgit-Baltistan",
        "Parts Used": "Fruit, whole plant",
        "Uses": "Fever, skin issues, diabetes, stomach problems, freckles",
        "Preparation & Dosage": "Direct application",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Allium carolinianum",
        "Local Name": "Not known",
        "Family": "Alliaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Whole plant, tuber",
        "Uses": "Tonic for body strength, vegetable",
        "Preparation & Dosage": "Direct consumption",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Juniperus communis",
        "Local Name": "Shukpa",
        "Family": "Cupressaceae",
        "Type": "Tree",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Berries",
        "Uses": "Kidney stones, urinary tract infections",
        "Preparation & Dosage": "Decoction, powder",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Ephedra gerardiana",
        "Local Name": "Yaizeh/Burzehm",
        "Family": "Ephedraceae",
        "Type": "Shrub",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Cough, asthma, backache, post-delivery swelling",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Berberis orthobotrys",
        "Local Name": "Istarboo",
        "Family": "Berberidaceae",
        "Type": "Shrub",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Leaves, stem, root bark",
        "Uses": "Jaundice, stomach problems, injuries",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Betula utilis",
        "Local Name": "Staapa",
        "Family": "Betulaceae",
        "Type": "Tree",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Bark",
        "Uses": "Warts, skin allergies",
        "Preparation & Dosage": "Smoldered bark applied topically",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Descurainia sophia",
        "Local Name": "Halacho",
        "Family": "Brassicaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Seeds",
        "Uses": "Chest complaints, throat problems, tonsils",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Sisymbrium brassiciforme",
        "Local Name": "Not known",
        "Family": "Brassicaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Leaves",
        "Uses": "Salad, aphrodisiac, carminative",
        "Preparation & Dosage": "Fresh leaves eaten",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Capparis spinosa",
        "Local Name": "Not known",
        "Family": "Capparidaceae",
        "Type": "Shrub",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Buds, flowers, fruit",
        "Uses": "Cough, flu",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Arctium lappa",
        "Local Name": "Not known",
        "Family": "Compositae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Root",
        "Uses": "Joint pains",
        "Preparation & Dosage": "Powder",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Artemisia brevifolium",
        "Local Name": "Bursay",
        "Family": "Compositae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Diabetes, fever, roundworms, stomach problems",
        "Preparation & Dosage": "Powder, decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Artemisia santolinifolia",
        "Local Name": "Kinbursay",
        "Family": "Compositae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Wound healing",
        "Preparation & Dosage": "Powder",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Cousinia thomsonii",
        "Local Name": "Churcho",
        "Family": "Compositae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Cancer, cough, asthma",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Tanacetum falconeri",
        "Local Name": "Tialo",
        "Family": "Compositae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Leaves, flowers",
        "Uses": "Abdominal problems, asthma, blood pressure, jaundice",
        "Preparation & Dosage": "Powder, decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Taraxacum stenolepium",
        "Local Name": "Shantha",
        "Family": "Compositae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Liver problems, fatigue, joint pains",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Elaeagnus angustifolia",
        "Local Name": "Not known",
        "Family": "Elaeagnaceae",
        "Type": "Tree",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Dry fruits",
        "Uses": "Stomach problems, cough",
        "Preparation & Dosage": "Direct consumption",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Hippophae rhamnoides",
        "Local Name": "Rayna",
        "Family": "Elaeagnaceae",
        "Type": "Shrub",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Fruits",
        "Uses": "Stomach problems, anticancer",
        "Preparation & Dosage": "Fresh/dry fruits eaten",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Gentianodes tianschanica",
        "Local Name": "Tikta",
        "Family": "Gentianaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Malaria, stomach disorders, liver problems, asthma, pneumonia",
        "Preparation & Dosage": "Decoction, powder",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Swertia petiolata",
        "Local Name": "Chundal",
        "Family": "Gentianaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Liver problems, diabetes, stomach disorders, skin eruptions, lice, easy delivery",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Geranium pratense",
        "Local Name": "Not known",
        "Family": "Geraniaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Wound healing, male sexual stimulation",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Mentha longifolia",
        "Local Name": "Folling",
        "Family": "Labiatae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Stomach problems, menstrual issues, cold, cough, gastric troubles, fever",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Nepeta leucolaena",
        "Local Name": "Azumal",
        "Family": "Labiatae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Aerial parts",
        "Uses": "Stomach problems, constipation",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Thymus linearis",
        "Local Name": "Tumburug",
        "Family": "Labiatae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Cold, cough, fever, indigestion",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Trifolium pratense",
        "Local Name": "Bulboksook",
        "Family": "Papilionaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Fever, cough, digestive problems",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Plantago major",
        "Local Name": "Boqna",
        "Family": "Plantaginaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Seeds",
        "Uses": "Eye redness, thirst relief",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Bistorta vivipara",
        "Local Name": "Chapdeh",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Roots",
        "Uses": "Inflammation, cancer",
        "Preparation & Dosage": "Powder",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Fagopyrum esculentum",
        "Local Name": "Brau",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Flour, leaves",
        "Uses": "Bread, vegetable, fodder; honey for cancer, asthma, cough",
        "Preparation & Dosage": "Flour for bread, leaves as vegetable",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Rheum spiciforme",
        "Local Name": "Khakhol",
        "Family": "Polygonaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Roots",
        "Uses": "Stomach disorders, constipation, acidity, hepatitis, wound healing",
        "Preparation & Dosage": "Powder",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Delphinium brunonianum",
        "Local Name": "Makhoting",
        "Family": "Ranunculaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Roots",
        "Uses": "Stomach disorders, constipation, acidity, hepatitis, wound healing",
        "Preparation & Dosage": "Powder",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Rosa webbiana",
        "Local Name": "Siah",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Flowers",
        "Uses": "Cough, chest problems, throat issues, piles, blood pressure",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Spiraea canescens",
        "Local Name": "Schmenouk",
        "Family": "Rosaceae",
        "Type": "Shrub",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Root bark, stem bark",
        "Uses": "Blood purification, mental relaxation, skin problems, blood pressure",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Galium boreale",
        "Local Name": "Karazeh",
        "Family": "Rubiaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Stem, branches",
        "Uses": "Arthritis, joint pains",
        "Preparation & Dosage": "Oil from burned stems",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Bergenia stracheyi",
        "Local Name": "Shapure",
        "Family": "Saxifragaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Roots",
        "Uses": "Wound healing, backache, stomach ulcers, chest problems, diabetes",
        "Preparation & Dosage": "Powder",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Saxifraga flagellaris",
        "Local Name": "Not known",
        "Family": "Saxifragaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Roots",
        "Uses": "Wound healing, backache, stomach ulcers, chest problems, diabetes",
        "Preparation & Dosage": "Powder",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Verbascum thapsus",
        "Local Name": "Apo Tambaku",
        "Family": "Scrophulariaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Roots",
        "Uses": "Hair elongation, dandruff",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Physochlaina praealta",
        "Local Name": "Luntung",
        "Family": "Solanaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Seeds",
        "Uses": "Fever, swellings, removal of dead fetus during delivery",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Poisonous"
    },
    {
        "Scientific Name": "Myricaria germanica",
        "Local Name": "Omboh",
        "Family": "Tamaricaceae",
        "Type": "Shrub",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Leaves",
        "Uses": "Antiseptic for cattle sheds",
        "Preparation & Dosage": "Powder",
        "Side Effects / Precautions": "Poisonous"
    },
    {
        "Scientific Name": "Tamarix elegans",
        "Local Name": "Omboh",
        "Family": "Tamaricaceae",
        "Type": "Shrub",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Leaves",
        "Uses": "Livestock wound healing (wolf bites)",
        "Preparation & Dosage": "Powder",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Carum carvi",
        "Local Name": "Kohyounth",
        "Family": "Umbelliferae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Seeds",
        "Uses": "Cold, fever, abdominal pain, flu, asthma",
        "Preparation & Dosage": "Direct use",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Pleurospermum candollei",
        "Local Name": "Shabdun",
        "Family": "Umbelliferae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Whole plant",
        "Uses": "Abdominal problems, stomach disorders, cholesterol, blood pressure, heart issues",
        "Preparation & Dosage": "Decoction",
        "Side Effects / Precautions": "Not specified"
    },
    {
        "Scientific Name": "Urtica dioica",
        "Local Name": "Not known",
        "Family": "Urticaceae",
        "Type": "Herb",
        "Location": "Turmic Valley, Gilgit-Baltistan",
        "Parts Used": "Whole plant, roots",
        "Uses": "Joint pain, cold, cough, body warmth; vegetable",
        "Preparation & Dosage": "Decoction, direct consumption",
        "Side Effects / Precautions": "May cause irritation"
    }
]

